{
  "ttl_days": 7,
  "as_of": "2026-02-07T03:09:41.368190+00:00",
  "next_refresh": "2026-02-07T00:20:00+00:00",
  "items": [
    {
      "symbol": "ABBV",
      "sector": "Healthcare",
      "industry": "Drug Manufacturers - General",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:08.699983+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.abbvie.com",
      "employee_count": null,
      "business_summary": "AbbVie Inc., a research-based biopharmaceutical company, engages in the research and development, manufacture, commercialization, and sale of medicines and therapies worldwide. The company offers Humira, an injection for autoimmune and intestinal Behçet's diseases, generalized pustular psoriasis, and pyoderma gangrenosum; Skyrizi to treat autoimmune diseases, erythrodermic psoriasis, generalized pustular psoriasis, and palmoplantar pustulosis; Rinvoq to treat inflammatory diseases; Imbruvica for",
      "market_cap": 394886709248,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ACHR",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:09.835865+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.archer.com",
      "employee_count": 774,
      "business_summary": "Archer Aviation Inc., together with its subsidiaries, designs and develops aircraft and related technologies and services in the United States and internationally. It operates through the commercial and defense sectors. The company offers electric vertical takeoff and landing (eVTOL) aircraft for use in urban air mobility (UAM) and Archer Direct, a commercial aircraft. It also provides direct-to-consumer aerial ride share services and maintenance and repair services. The company was incorporated",
      "market_cap": 5358996992,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ADBE",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:10.974073+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.adobe.com",
      "employee_count": 31360,
      "business_summary": "Adobe Inc. operates as a technology company worldwide. The Digital Media segment offers products and services that enable individuals, teams, and enterprises to create, publish, and promote content. This segment serves photographers, video editors, graphic and experience designers, game developers, content creators, students, marketers, business owners, knowledge workers, and consumers. The Digital Experience segment provides an integrated platform; and products, services, and solutions that ena",
      "market_cap": 112343867392,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ALAB",
      "sector": "Technology",
      "industry": "Semiconductors",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:12.115427+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.asteralabs.com",
      "employee_count": 440,
      "business_summary": "Astera Labs, Inc. designs, manufactures, and sells semiconductor-based connectivity solutions for cloud and AI infrastructure. It offers an intelligent connectivity platform, comprised of semiconductor-based, mixed-signal connectivity products that integrate a matrix of microcontrollers and sensors, and COSMOS. The company provides COSMOS software suite, a connectivity system management and optimization software that enables management and optimization of resources for large fleets at cloud-scal",
      "market_cap": 28688279552,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "AMD",
      "sector": "Technology",
      "industry": "Semiconductors",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:13.254686+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.amd.com",
      "employee_count": 31000,
      "business_summary": "Advanced Micro Devices, Inc. operates as a semiconductor company internationally. It operates in three segments: Data Center, Client and Gaming, and Embedded. The company offers artificial intelligence (AI) accelerators, microprocessors, and graphics processing units (GPUs) as standalone devices or as incorporated into accelerated processing units, chipsets, and data center and professional GPUs; and embedded processors and semi-custom system-on-chip (SoC) products, microprocessor and SoC develo",
      "market_cap": 339842859008,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "AMZN",
      "sector": "Consumer Cyclical",
      "industry": "Internet Retail",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:14.393744+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.amazon.com",
      "employee_count": 1578000,
      "business_summary": "Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, fire tablets, fire TVs, echo, ring, blink, and eero; and develops and produces media content. In addition, the company offers programs that enable ",
      "market_cap": 2257768677376,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "APP",
      "sector": "Communication Services",
      "industry": "Advertising Agencies",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:15.559863+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.applovin.com",
      "employee_count": 1533,
      "business_summary": "AppLovin Corporation engages in building a software-based platform for advertisers to enhance the marketing and monetization of their content in the United States and internationally. It operates through two segments, Advertising and Apps. The company offers AppDiscovery, an advertising solution, which matches advertiser demand with publisher supply through auctions; MAX, an in-app bidding technology that optimizes the value of a publisher's advertising inventory by running a real-time competiti",
      "market_cap": 137573007360,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ASTS",
      "sector": "Technology",
      "industry": "Communication Equipment",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:16.728909+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://ast-science.com",
      "employee_count": 578,
      "business_summary": "AST SpaceMobile, Inc., together with its subsidiaries, designs and develops the constellation of BlueBird satellites in the United States. The company provides a cellular broadband network in space to be accessible directly by smartphones for commercial use and other applications, as well as for government use. Its SpaceMobile service provides cellular broadband services to end-users who are out of terrestrial cellular coverage. The company was founded in 2017 and is headquartered in Midland, Te",
      "market_cap": 37397778432,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "AVAV",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:17.896680+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.avinc.com",
      "employee_count": 1456,
      "business_summary": "AeroVironment, Inc. designs, develops, produces, delivers, and supports a portfolio of robotic systems and related services for government agencies and businesses in the United States and internationally. It operates in two segments, Autonomous Systems; and Space, Cyber and Directed Energy. The company provides uncrewed aircraft systems (UAS), which include small and medium UAS, and kinesis command and control software; and counter-UAS and precision strike, a loitering munitions solution that de",
      "market_cap": 12842564608,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "AVGO",
      "sector": "Technology",
      "industry": "Semiconductors",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:19.065263+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.broadcom.com",
      "employee_count": 33000,
      "business_summary": "Broadcom Inc. designs, develops, and supplies various semiconductor devices and infrastructure software solutions internationally. The company operates in two segments: Semiconductor Solutions and Infrastructure Software. The company offers networking connectivity, such as custom silicon solutions, ethernet switching & routing, ethernet NIC controllers, physical layer devices, and fiber optic components; wireless device connectivity, including RF semiconductor devices, connectivity solutions, cu",
      "market_cap": 1578464837632,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "AXON",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:20.227761+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.axon.com",
      "employee_count": 4100,
      "business_summary": "Axon Enterprise, Inc. provides public safety technology solutions in the United States and internationally. The company operates in two segments, Software and Sensors, and TASER. The Software and Sensors segment develops, manufactures, and sells integrated hardware and cloud-based software solutions that enable law enforcement to capture, store, manage, share, and analyze video and other digital evidence. This segment also offers body cameras, in-car cameras, other hardware sensors, warranties o",
      "market_cap": 32902916096,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "AXP",
      "sector": "Financial Services",
      "industry": "Credit Services",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:21.361214+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.americanexpress.com",
      "employee_count": null,
      "business_summary": "American Express Company, together with its subsidiaries, operates as integrated payments company in the United States, Europe, the Middle East and Africa, the Asia Pacific, Australia, New Zealand, Latin America, Canada, the Caribbean, and Internationally. It operates through four segments: U.S. Consumer Services, Commercial Services, International Card Services, and Global Merchant and Network Services. The company's products and services include credit card, charge card, banking, and other pay",
      "market_cap": 247401070592,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "BA",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:22.500014+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.boeing.com",
      "employee_count": 182000,
      "business_summary": "The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through three segments: Commercial Airplanes; Defense, Space & Security; and Global Services. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements. The Defens",
      "market_cap": 190862901248,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "BAC",
      "sector": "Financial Services",
      "industry": "Banks - Diversified",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:23.678645+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.bankofamerica.com",
      "employee_count": 213207,
      "business_summary": "Bank of America Corporation, through its subsidiaries, provides various financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. The company operates through four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, c",
      "market_cap": 412810084352,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "BE",
      "sector": "Industrials",
      "industry": "Electrical Equipment & Parts",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:24.814330+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.bloomenergy.com",
      "employee_count": 2127,
      "business_summary": "Bloom Energy Corporation designs, manufactures, sells, and installs solid-oxide fuel cell systems for on-site power generation in the United States and internationally. It offers Bloom Energy Server, a power generation platform to convert fuel, such as natural gas, biogas, hydrogen, or a blend of these fuels, into electricity through an electrochemical process without combustion. The company also provides Bloom Electrolyzer for producing hydrogen. It sells its products through direct and indirec",
      "market_cap": 40054902784,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "BRK-B",
      "sector": "Financial Services",
      "industry": "Insurance - Diversified",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:25.948720+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.berkshirehathaway.com",
      "employee_count": 392400,
      "business_summary": "Berkshire Hathaway Inc., through its subsidiaries, engages in the insurance, freight rail transportation, and utility businesses. The company provides property, casualty, life, accident, and health insurance and reinsurance; operates railroad systems in North America; generates, transmits, stores, and distributes electricity from natural gas, coal, wind, solar, hydroelectric, nuclear, and geothermal sources; operates natural gas distribution and storage facilities, interstate pipelines, liquefie",
      "market_cap": 1096120205312,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "BWXT",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:27.110043+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.bwxt.com",
      "employee_count": 8700,
      "business_summary": "BWX Technologies, Inc. manufactures and sells nuclear components in the United States, Canada, and internationally. It operates through two segments, Government Operations and Commercial Operations. The company manufactures precision naval nuclear components, reactors, and nuclear fuel; close-tolerance and high-quality equipment for nuclear applications; critical nuclear components, fuels and assemblies for government and limited other uses; down blend government stockpiles of uranium; and fabri",
      "market_cap": 18028439552,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CAT",
      "sector": "Industrials",
      "industry": "Farm & Heavy Construction Machinery",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:28.243708+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.caterpillar.com",
      "employee_count": null,
      "business_summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives in the United States and internationally. Its Construction Industries segment offers asphalt pavers, cold planers, compactors, forestry machines, material handlers, motor graders, pipelayers, road reclaimers, telehandlers, track-type tractors, and track and wheel excavators; compact track, wheel, track-type, backhoe, and s",
      "market_cap": 340209401856,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CCJ",
      "sector": "Energy",
      "industry": "Uranium",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:29.382247+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "Canada",
      "website": "https://www.cameco.com",
      "employee_count": null,
      "business_summary": "Cameco Corporation provides uranium for the generation of electricity. It operates through three segments: Uranium, Fuel Services, and Westinghouse. The Uranium segment engages in the exploration for, mining, milling, purchase, and sale of uranium concentrate. The Fuel Services segment is involved in the refining, conversion, and fabrication of uranium concentrate, as well as purchase and sale of conversion services. The Westinghouse segment operates as a nuclear reactor technology original equi",
      "market_cap": 49616764928,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CEG",
      "sector": "Utilities",
      "industry": "Utilities - Independent Power Producers",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:30.526227+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.constellationenergy.com",
      "employee_count": 14215,
      "business_summary": "Constellation Energy Corporation produces and sells energy products and services in the United States. It operates through five segments: Mid-Atlantic, Midwest, New York, ERCOT, and Other Power Regions. The company offers electricity, natural gas, energy-related products, and sustainable solutions. It has approximately 31,676 megawatts of generating capacity consisting of nuclear, wind, solar, natural gas, and hydroelectric assets. The company serves distribution utilities, municipalities, coope",
      "market_cap": 94709874688,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CHYM",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:31.705485+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.chime.com",
      "employee_count": null,
      "business_summary": "Chime Financial, Inc., a financial technology company, provides digital consumer banking and payment solutions. It offers Chime, a banking application for providing mobile banking services that address the need of people, such as their spending, saving, accessing liquidity, building credit, savings and perks, community, and support and security. Chime Financial, Inc. was formerly known as 1Debit Inc. and changed its name to Chime Financial, Inc. in June 2019. Chime Financial, Inc. was incorporat",
      "market_cap": 8158308864,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CIFR",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:32.846816+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.ciphermining.com",
      "employee_count": 43,
      "business_summary": "Cipher Mining Inc., together with its subsidiaries, develops and operates industrial-scale data centers in the United States. The company was founded in 2021 and is headquartered in New York, New York.",
      "market_cap": 5819705856,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CLSK",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:33.990021+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NCM",
      "country": "United States",
      "website": "https://www.cleanspark.com",
      "employee_count": 309,
      "business_summary": "CleanSpark, Inc. operates as a bitcoin mining company in the Americas. The company owns, leases, and operates data centers and power assets. Its infrastructure supports Bitcoin, a digital commodity. The company was formerly known as Stratean Inc. and changed its name to CleanSpark, Inc. in November 2016. CleanSpark, Inc. was incorporated in 1987 and is headquartered in Henderson, Nevada.",
      "market_cap": 2577989376,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "COIN",
      "sector": "Financial Services",
      "industry": "Financial Data & Stock Exchanges",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:35.127134+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.coinbase.com",
      "employee_count": 3772,
      "business_summary": "Coinbase Global, Inc. operates platform for crypto assets in the United States and internationally. It offers the primary financial account in the crypto economy for consumers; a brokerage platform with a pool of liquidity across the crypto marketplace for institutions; and a suite of products granting access to build onchain for developers. The company was founded in 2012 and is based in New York, New York.",
      "market_cap": 44525862912,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "COST",
      "sector": "Consumer Defensive",
      "industry": "Discount Stores",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:36.263811+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.costco.com",
      "employee_count": 341000,
      "business_summary": "Costco Wholesale Corporation, together with its subsidiaries, engages in the operation of membership warehouses in the United States, Puerto Rico, Canada, Mexico, Japan, the United Kingdom, Korea, Australia, Taiwan, China, Spain, France, Iceland, New Zealand, and Sweden. It offers merchandise, including sundries, dry groceries, candies, coolers, freezers, deli, liquor, and tobacco; non-food merchandise comprising appliances, small electronics, health and beauty aids, hardware, lawn and garden, s",
      "market_cap": 444472688640,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CRCL",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:37.399304+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.circle.com",
      "employee_count": null,
      "business_summary": "Circle Internet Group, Inc. operates as a platform, network, and market infrastructure for stablecoin and blockchain applications. The company provides a suite of stablecoins and related products that include a network utility and application platform for organizations to benefit from stablecoins and the internet financial system; and issues a U.S. dollar-denominated stablecoin. Its stablecoins network comprises circle stablecoins, tokenized funds, liquidity, payments, and developer services, as",
      "market_cap": 14513122304,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CRM",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:38.557462+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.salesforce.com",
      "employee_count": 76453,
      "business_summary": "Salesforce, Inc. provides customer relationship management technology that connects companies and customers together worldwide. The company offers Agentforce, an agentic layer of the salesforce platform; Data Cloud, a data engine; Industries AI for creating industry-specific AI agents with Agentforce; Salesforce Starter, a suite of solution for small and medium-size business; Slack, a workplace communication and productivity platform; Tableau, an end-to-end analytics solution for range of enterp",
      "market_cap": 182165209088,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CRWD",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:39.692041+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.crowdstrike.com",
      "employee_count": 10410,
      "business_summary": "CrowdStrike Holdings, Inc. provides cybersecurity solutions in the United States and internationally. Its unified platform provides cloud-delivered protection of endpoints, cloud workloads, identity, and data through a software as a service (SaaS) subscription-based model. The company offers corporate endpoint and cloud workload security, managed security, security and vulnerability management, IT operations management, identity protection, threat intelligence, data protection, SaaS security pos",
      "market_cap": 99704930304,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CRWV",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:40.830713+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.coreweave.com",
      "employee_count": 881,
      "business_summary": "CoreWeave, Inc. operates a cloud platform that provides scaling, support, and acceleration for GenAI. The company builds the infrastructure that supports compute workloads for enterprises. Its products include GPU compute, CPU compute, storage services, networking services, managed services, and virtual and bare metal servers. The company's platform offers a fleet lifecycle controller, node lifecycle controller, tensorizer, and observability. Its services also include VFX and rendering, AI model",
      "market_cap": 46886731776,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CSCO",
      "sector": "Technology",
      "industry": "Communication Equipment",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:41.965286+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.cisco.com",
      "employee_count": 86200,
      "business_summary": "Cisco Systems, Inc. designs, develops, and sells technologies that help to power, secure, and draw insights from the internet in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. The company offers data center switching; network security, identity and access management, and secure access service edge; threat intelligence, detection, and response solutions; interconnects public and private wireline and mobile networks, delivering connectivity to campus, data cente",
      "market_cap": 335131836416,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CVX",
      "sector": "Energy",
      "industry": "Oil & Gas Integrated",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:43.134713+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.chevron.com",
      "employee_count": null,
      "business_summary": "Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment engages in the exploration, development, production, and transportation of crude oil and natural gas; liquefaction, transportation, and regasification of liquefied natural gas; transporting crude oil through pipelines; processing, transporting, storage, and marketing o",
      "market_cap": 361603104768,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "D-WAVE",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 0.8,
      "sources": [
        "fallback_data"
      ],
      "last_verified_at": "2026-02-07T03:07:44.386826+00:00",
      "market_cap_category": "unknown",
      "exchange": "NASDAQ",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "",
      "market_cap": null,
      "api_source": "fallback"
    },
    {
      "symbol": "DDOG",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:45.522925+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.datadoghq.com",
      "employee_count": 6500,
      "business_summary": "Datadog, Inc. operates an observability and security platform for cloud applications in the United States and internationally. The company's products comprise infrastructure and application performance monitoring, log management, digital experience monitoring, continuous profiler, database monitoring, data observability, universal service monitoring, network monitoring, error tracking, incident management, workflow automation, observability pipelines, cloud cost and cloud security management, ap",
      "market_cap": 39166418944,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "DGRO",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:46.660731+00:00",
      "market_cap_category": "unknown",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The fund generally will invest at least 80% of its assets in the component securities of its underlying index and in investments that have economic characteristics that are substantially identical to the component securities of its underlying index. The underlying index is a subset of the Morningstar® U.S. Market IndexSM, which is a broad market index that represents approximately 97% of the market capitalization of publicly-traded U.S. stocks.",
      "market_cap": 0,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "DIA",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:47.794721+00:00",
      "market_cap_category": "large_cap",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The Trust’s Portfolio consists of substantially all of the component common stocks that comprise the DJIA, which are weighted in accordance with the terms of the Trust Agreement.",
      "market_cap": 40705126400,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "DIVO",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:48.932884+00:00",
      "market_cap_category": "unknown",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "Under normal circumstances, the fund invests at least 80% of its net assets in dividend-paying U.S. exchange-traded equity securities (\"Equity Securities\") and will opportunistically utilize an \"option strategy\" consisting of writing (selling) U.S. exchange-traded covered call options on such Equity Securities. The fund is non-diversified.",
      "market_cap": 0,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "DUOL",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:50.070579+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.duolingo.com",
      "employee_count": 830,
      "business_summary": "Duolingo, Inc. operates as a mobile learning platform in the United States, the United Kingdom, and internationally. The company offers courses in 40 different languages, including Spanish, English, French, German, Italian, Portuguese, Japanese, and Chinese through its Duolingo app. It also provides a digital English language proficiency assessment exam. The company was incorporated in 2011 and is headquartered in Pittsburgh, Pennsylvania.",
      "market_cap": 5519546368,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "EOSE",
      "sector": "Industrials",
      "industry": "Electrical Equipment & Parts",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:51.209987+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NCM",
      "country": "United States",
      "website": "https://www.eose.com",
      "employee_count": 430,
      "business_summary": "Eos Energy Enterprises, Inc. designs, develops, manufactures, and markets energy storage solutions for utility-scale, microgrid, and commercial and industrial applications in the United States. The company offers Znyth technology battery energy storage system (BESS), which provides the operating flexibility to manage increased grid complexity and price volatility. It also provides Z3 battery module that provides utilities, independent power producers, renewables developers, and commercial and in",
      "market_cap": 3989648640,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ETN",
      "sector": "Industrials",
      "industry": "Specialty Industrial Machinery",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:52.386458+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "Ireland",
      "website": "https://www.eaton.com",
      "employee_count": null,
      "business_summary": "Eaton Corporation plc operates as a power management company in the United States, Canada, Latin America, Europe, and the Asia Pacific. It operates through Electrical Americas, Electrical Global, Aerospace, Vehicle, and eMobility segments. The company offers electrical components, industrial components, power distribution and assemblies, residential products, single and three phase power quality and connectivity products, wiring devices, circuit protection products, utility power distribution pr",
      "market_cap": 145528127488,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "FIG",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:53.530793+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.figma.com",
      "employee_count": 1831,
      "business_summary": "Figma, Inc. develops a browser-based tool for designing user interfaces that helps design and development teams build various products. The company offers Figma Design, a collaborative design tool for teams that explore ideas and gather feedback, build realistic prototypes, and streamline product development with design systems; Dev Mode to inspect designs and translate them into code without changing the design file; FigJam to define ideas, align on decisions, and move work forwardall in one p",
      "market_cap": 10898061312,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "GEV",
      "sector": "Industrials",
      "industry": "Specialty Industrial Machinery",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:54.671868+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.gevernova.com",
      "employee_count": 78000,
      "business_summary": "GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. It serves industrial, government, and other customers. The Wind segment offers wind generation",
      "market_cap": 211453591552,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "GLD",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:55.807556+00:00",
      "market_cap_category": "large_cap",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The Trust holds gold bars and from time to time, issues Baskets in exchange for deposits of gold and distributes gold in connection with redemptions of Baskets. The investment objective of the Trust is for the Shares to reflect the performance of the price of gold bullion, less the Trust’s expenses. The Sponsor believes that, for many investors, the Shares represent a cost-effective investment in gold.",
      "market_cap": 118556237824,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "GOOG",
      "sector": "Communication Services",
      "industry": "Internet Content & Information",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:56.955939+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://abc.xyz",
      "employee_count": 190820,
      "business_summary": "Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the ",
      "market_cap": 3908540825600,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "GRAB",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:58.121277+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "Singapore",
      "website": "https://www.grab.com/sg",
      "employee_count": 11267,
      "business_summary": "Grab Holdings Limited engages in the provision of superapps in Cambodia, Indonesia, Malaysia, Myanmar, the Philippines, Singapore, Thailand, and Vietnam. It operates through four segments: Deliveries, Mobility, Financial services, and Others. The company offers its Grab ecosystem, a single platform with superapps for driver- and merchant-partners and consumers, that allows access to mobility, delivery, and digital financial services. It also provides digital banking services. Grab Holdings Limit",
      "market_cap": 17451489280,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "GS",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:07:59.258754+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.goldmansachs.com",
      "employee_count": 47400,
      "business_summary": "The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Global Banking & Markets, Asset & Wealth Management, and Platform Solutions segments. The Global Banking & Markets segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, c",
      "market_cap": 281152225280,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "HD",
      "sector": "Consumer Cyclical",
      "industry": "Home Improvement Retail",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:00.391249+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.homedepot.com",
      "employee_count": 470000,
      "business_summary": "The Home Depot, Inc. operates as a home improvement retailer in the United States and internationally. It sells various building materials, home improvement products, lawn and garden products, and décor products, as well as facilities maintenance, repair, and operations products. The company also offers installation services for flooring, water heaters, baths, garage doors, cabinets, cabinet makeovers, countertops, sheds, furnaces and central air systems, and windows. In addition, it provides to",
      "market_cap": 383421251584,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "HIMS",
      "sector": "Healthcare",
      "industry": "Drug Manufacturers - Specialty & Generic",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:01.528221+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.hims.com",
      "employee_count": 1637,
      "business_summary": "Hims & Hers Health, Inc. operates a telehealth platform that connects consumers to licensed healthcare professionals in the United States, the United Kingdom, Canada, and internationally. The company offers a range of curated prescription and non-prescription health and wellness products and services available to purchase on its websites and mobile application directly by customers. It also provides prescription medication on a recurring basis and ongoing care from healthcare providers; and over",
      "market_cap": 5240468992,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "HON",
      "sector": "Industrials",
      "industry": "Conglomerates",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:02.665821+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.honeywell.com",
      "employee_count": null,
      "business_summary": "Honeywell International Inc. engages in the aerospace technologies, industrial automation, building automation, and energy and sustainable solutions businesses in the United States, Europe, and internationally. The company's Aerospace Technologies segment offers auxiliary power units, propulsion engines, integrated avionics, environmental control and electric power systems, engine controls, flight safety, communications, navigation hardware, data and software applications, radar and surveillance",
      "market_cap": 160637059072,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "HOOD",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:03.805836+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://robinhood.com",
      "employee_count": 2300,
      "business_summary": "Robinhood Markets, Inc. operates financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds (ETFs), American depository receipts, options, gold, and cryptocurrencies. The company offers fractional trading, recurring investments, fully-paid securities lending, access to investing on margin, cash sweep, instant withdrawals, retirement program, around-the-clock trading, joint investing accounts, event contracts, and future contract service",
      "market_cap": 74470817792,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "HUT",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:04.943133+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://hut8.com",
      "employee_count": 222,
      "business_summary": "Hut 8 Corp. operates as a vertically integrated operator of energy infrastructure and Bitcoin miners in North America. The company operates through four segments: Power, Digital Infrastructure, Compute, and Other. It also offers managed services for energy infrastructure development, such as site design, procurement, and construction management; software automation, process design, personnel hiring, and team training; utilities contracts, hosting operations, and customer management; energy portf",
      "market_cap": 5732423680,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "IBKR",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:06.078610+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.interactivebrokers.com",
      "employee_count": null,
      "business_summary": "Interactive Brokers Group, Inc. operates as an automated electronic broker in the United States and internationally. The company engages in the execution, clearance, and settlement of trades in stocks, options, futures, foreign exchange instruments, bonds, mutual funds, exchange traded funds (ETFs), precious metals, and cryptocurrencies. It also offers custody and service accounts for hedge and mutual funds, ETFs, registered investment advisors, proprietary trading groups, introducing brokers, a",
      "market_cap": 126798331904,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "IBM",
      "sector": "Technology",
      "industry": "Information Technology Services",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:07.233279+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.ibm.com",
      "employee_count": null,
      "business_summary": "International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offers hybrid cloud and AI platforms that allows clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. Its Consulting segment focuse",
      "market_cap": 279420403712,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "INTR",
      "sector": "Financial Services",
      "industry": "Banks - Regional",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:08.373906+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NMS",
      "country": "Brazil",
      "website": "https://inter.co",
      "employee_count": null,
      "business_summary": "Inter & Co, Inc., through its subsidiaries, engages in the banking and spending, investments, insurance brokerage, and inter shop businesses in Brazil and the United States. The company offers banking products and services, including checking accounts; cards; deposits; loans and advances; and other services, as well as debt collection; foreign exchange and financial services; and global account digital solution. It also provides acquisition, sale, and custody of securities; structures and distri",
      "market_cap": 3904421632,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "INTU",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:09.544709+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.intuit.com",
      "employee_count": 18200,
      "business_summary": "Intuit Inc. provides financial management, payments and capital, compliance, and marketing products and services in the United States. The company operates in four segments: Global Business Solutions, Consumer, Credit Karma, and ProTax. The Global Business Solutions segment provides QuickBooks services, which include financial and business management online services, desktop software, payroll solutions, time tracking, merchant payment processing and bill pay solutions, checking accounts, and fin",
      "market_cap": 123545567232,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "IONQ",
      "sector": "Technology",
      "industry": "Computer Hardware",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:10.715333+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://ionq.com",
      "employee_count": 407,
      "business_summary": "IonQ, Inc. develops quantum computers and networks in the United States. It sells access to quantum computers of various qubit capacities. The company also makes access to its quantum computers through cloud platforms, such as Amazon Web Services (AWS) Amazon Braket, Microsoft's Azure Quantum, and Google's Cloud Marketplace, as well as through its cloud service. The company engages in quantum-safe networking and quantum detection systems. It offers quantum key distribution systems, quantum rando",
      "market_cap": 12574032896,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "IREN",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:11.852810+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "Australia",
      "website": "https://iren.com",
      "employee_count": 257,
      "business_summary": "IREN Limited operates in the vertically integrated data center business in Australia and Canada. The company owns and operates computing hardware, as well as electrical infrastructure and data centers. It also mines Bitcoin, a scarce digital asset that is created and transmitted through the operation of a peer-to-peer network of computers running the Bitcoin software. The company was formerly known as Iris Energy Limited and changed its name to IREN Limited in November 2024. The company was inco",
      "market_cap": 13877486592,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "IWM",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:12.987685+00:00",
      "market_cap_category": "large_cap",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The fund generally invests at least 80% of its assets in the component securities of its underlying index and in investments that have economic characteristics that are substantially identical to the component securities of its underlying index (i.e., depositary receipts representing securities of the underlying index) and may invest up to 20% of its assets in certain futures, options and swap contracts, cash and cash equivalents.",
      "market_cap": 74483867648,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "JEPI",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:14.175497+00:00",
      "market_cap_category": "unknown",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The fund seeks to achieve this objective by (1) creating an actively managed portfolio of equity securities and (2) through equity-linked notes (ELNs),selling call options with exposure to the fund’s primary benchmark, the Standard & Poor’s 500 Total Return Index (the Benchmark). The resulting Fund is designed to provide investors with total return through capital appreciation and income, while exposing investors to lower volatility than the broad U.S. large cap market and also providing increme",
      "market_cap": 0,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "JEPQ",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:15.317732+00:00",
      "market_cap_category": "unknown",
      "exchange": "NGM",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The fund seeks to achieve this objective by (1) creating an actively managed portfolio of equity securities comprised significantly of those included in the fund’s primary benchmark, the Nasdaq-100 Index® (the Benchmark), and (2) through equity-linked notes (ELNs), selling call options with exposure to the Benchmark. It is non-diversified.",
      "market_cap": 0,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "JNJ",
      "sector": "Healthcare",
      "industry": "Drug Manufacturers - General",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:16.453533+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.jnj.com",
      "employee_count": null,
      "business_summary": "Johnson & Johnson, together with its subsidiaries, engages in the research and development, manufacture, and sale of various products in the healthcare field worldwide. It operates in two segments, Innovative Medicine and MedTech. The Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV/AIDS; neuroscience, consisting of mood ",
      "market_cap": 578206760960,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "JOBY",
      "sector": "Industrials",
      "industry": "Airports & Air Services",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:17.592184+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.jobyaviation.com",
      "employee_count": 2029,
      "business_summary": "Joby Aviation, Inc., a vertically integrated air mobility company, engages in building an electric vertical takeoff and landing aircraft optimized to deliver air transportation as a service in the United States and Dubai. The company intends to build an aerial ridesharing service, as well as developing an app-based platform that will enable consumers to book rides. Joby Aviation, Inc. was founded in 2009 and is headquartered in Santa Cruz, California.",
      "market_cap": 10148082688,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "JPM",
      "sector": "Financial Services",
      "industry": "Banks - Diversified",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:18.759773+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.jpmorganchase.com",
      "employee_count": 318512,
      "business_summary": "JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. The company offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through ban",
      "market_cap": 877657325568,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "KO",
      "sector": "Consumer Defensive",
      "industry": "Beverages - Non-Alcoholic",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:19.896901+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.coca-colacompany.com",
      "employee_count": 69700,
      "business_summary": "The Coca-Cola Company, a beverage company, manufactures and sells various nonalcoholic beverages in the United States and internationally. The company provides sparkling soft drinks and flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers comprising restaurants and convenience stores. The company sells its products under the Coca-Cola, Di",
      "market_cap": 340118798336,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "KSPI",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:21.035428+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "Kazakhstan",
      "website": "https://ir.kaspi.kz",
      "employee_count": null,
      "business_summary": "Joint Stock Company Kaspi.kz, together with its subsidiaries, provides payments, marketplace, and fintech solutions for consumers and merchants in Kazakhstan, Azerbaijan, and Ukraine. It operates in three segments: Payments, Marketplace, and Fintech. The Payments segment offers a platform that facilities transactions between and among merchants and consumers. This segment provides ways for consumers to pay for shopping transactions and regular household bills, as well as make peer to peer paymen",
      "market_cap": 14847083520,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "KTOS",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:22.172011+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.kratosdefense.com",
      "employee_count": 4000,
      "business_summary": "Kratos Defense & Security Solutions, Inc., a technology company, provides technology, products, and system and software for the defense, national security, and commercial markets in the United States, other North America, the Asia Pacific, the Middle East, Europe, and Internationally. The company operates in two segments, Kratos Government Solutions and Unmanned Systems. It offers ground systems for satellites and space vehicles, including software for command and control, telemetry, and trackin",
      "market_cap": 15940251648,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "LEU",
      "sector": "Energy",
      "industry": "Uranium",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:23.312930+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.centrusenergy.com",
      "employee_count": 322,
      "business_summary": "Centrus Energy Corp. supplies nuclear fuel components for the nuclear power industry in the United States, Belgium, Japan, the Netherlands, and internationally. The company operates in two segments, Low-Enriched Uranium (LEU) and Technical Solutions. The LEU segment sells separative work units (SWU) components of LEU; natural uranium hexafluoride, uranium concentrates, and uranium conversion; and enriched uranium products to utilities that operate nuclear power plants. The Technical Solutions se",
      "market_cap": 4798324224,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "LRCX",
      "sector": "Technology",
      "industry": "Semiconductor Equipment & Materials",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:24.452174+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.lamresearch.com",
      "employee_count": 19700,
      "business_summary": "Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits in the United States, China, Korea, Taiwan, Japan, Southeast Asia, and Europe. The company offers ALTUS systems to deposit conformal or selective films for tungsten or molybdenum metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; SPEED g",
      "market_cap": 290155462656,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "LUNR",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:25.589315+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NGM",
      "country": "United States",
      "website": "https://www.intuitivemachines.com",
      "employee_count": 435,
      "business_summary": "Intuitive Machines, Inc. designs, manufactures, and operates space products and services in the United States. The company provides delivery services for the transportation and delivery of payloads, such as satellites, scientific instruments, and cargo to various destinations in space, rideshare delivery, and lunar surface access; data transmission services, which include the collection, processing, and interpretation of space-based data, utilizing AI applications, such as command, control, comm",
      "market_cap": 2493285632,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MA",
      "sector": "Financial Services",
      "industry": "Credit Services",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:26.730124+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.mastercard.com",
      "employee_count": null,
      "business_summary": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. The company offers integrated products and value-added services for account holders, merchants, financial institutions, digital partners, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its custome",
      "market_cap": 490264985600,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MAIN",
      "sector": "Financial Services",
      "industry": "Asset Management",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:27.872669+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.mainstcapital.com",
      "employee_count": 104,
      "business_summary": "Main Street Capital Corporation is a business development company and a small business investment company specializing in direct and indirect investments. In direct investments, the firm specializes in private equity capital to lower middle market companies. The firm specializes in recapitalizations, loan, growth capital, mezzanine debt, corporate carveouts, family estate planning, management buyouts, refinancing, private loan, private credit solutions, senior secured term debt, unintranche term",
      "market_cap": 5403024896,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MCD",
      "sector": "Consumer Cyclical",
      "industry": "Restaurants",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:29.039498+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.mcdonalds.com",
      "employee_count": 150000,
      "business_summary": "McDonald's Corporation owns, operates, and franchises restaurants under the McDonald's brand in the United States and internationally. It offers food and beverages, including hamburgers and cheeseburgers, various chicken sandwiches, fries, shakes, desserts, sundaes, soft serve cones, cookies, pies, soft drinks, coffee, and other beverages; and full or limited breakfast, as well as sells various other products during limited-time promotions. The company owns and operates franchised restaurants un",
      "market_cap": 233462824960,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MDB",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:30.175143+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NGM",
      "country": "United States",
      "website": "https://www.mongodb.com",
      "employee_count": 5639,
      "business_summary": "MongoDB, Inc., together with its subsidiaries, provides general purpose database platform worldwide. The company provides MongoDB Atlas, a hosted multi-cloud database-as-a-service solution; MongoDB Enterprise Advanced, a commercial database server for enterprise customers to run in the cloud, on-premises, or in a hybrid environment; and Community Server, a free-to-download version of its database, which includes the functionality that developers need to get started with MongoDB. It offers profes",
      "market_cap": 28027252736,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MELI",
      "sector": "Consumer Cyclical",
      "industry": "Internet Retail",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:31.349684+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "Uruguay",
      "website": "https://www.mercadolibre.com",
      "employee_count": 84207,
      "business_summary": "MercadoLibre, Inc. operates online commerce platforms in Brazil, Mexico, Argentina, and internationally. The company operates Mercado Libre Marketplace, an online commerce platform that can be accessed through mobile app or website; and Mercado Pago, a financial technology solution platform, which offers comprehensive set of financial technology services to users and other users of its e-commerce platform. It also provides Mercado Fondo that allows users to invest funds deposited in their Mercad",
      "market_cap": 99881058304,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "META",
      "sector": "Communication Services",
      "industry": "Internet Content & Information",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:32.486800+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.meta.com",
      "employee_count": 78865,
      "business_summary": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality (VR) headsets, and AI glasses in the United States, Canada, Europe, Asia-Pacific, and internationally. It operates through two segments, Family of Apps (FoA) and Reality Labs (RL). The FoA segment offers Facebook, which enables people to build community through feed, reels, stories, groups, marketplace, and other; ",
      "market_cap": 1673199747072,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MMM",
      "sector": "Industrials",
      "industry": "Conglomerates",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:33.633657+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.3m.com",
      "employee_count": 60500,
      "business_summary": "3M Company provides diversified technology services in the America, the Asia Pacific, Europe, the Middle East, Africa, and internationally. It operates through three segments: Safety and Industrial, Transportation and Electronics, and Consumer. The Safety and Industrial segment provides industrial abrasives and finishing for metalworking applications; autobody repair solutions; industrial specialty products, such as personal hygiene products, masking, and packaging materials; electrical products",
      "market_cap": 90934755328,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MP",
      "sector": "Basic Materials",
      "industry": "Other Industrial Metals & Mining",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:34.776985+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://mpmaterials.com",
      "employee_count": 804,
      "business_summary": "MP Materials Corp., together with its subsidiaries, produces rare earth materials in the Western Hemisphere. The company operates in two segments, Materials and Magnetics. The Materials segment owns and operates the Mountain Pass Rare Earth Mine and Processing facility located near Mountain Pass, San Bernardino County, California. The Magnetics segment produces magnetic precursor products. The company was founded in 2017 and is headquartered in Las Vegas, Nevada.",
      "market_cap": 10857139200,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MRK",
      "sector": "Healthcare",
      "industry": "Drug Manufacturers - General",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:35.915731+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.merck.com",
      "employee_count": null,
      "business_summary": "Merck & Co., Inc. operates as a healthcare company worldwide. The company offers human health pharmaceutical for various areas under the Keytruda, Welireg, Gardasil, ProQuad, M-M-R II, Varivax, Vaxneuvance, RotaTeq, Pneumovax 23, Bridion, Dificid, Zerbaxa, Noxafil, Winrevair, Adempas, Verquvo, Lagevrio, Isentress/Isentress HD, Delstrigo, Pifeltro, Belsomra, Januvia, and Janumet brands. It also provides veterinary pharmaceuticals, vaccines and health management solutions and services, such as liv",
      "market_cap": 304554704896,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MSFT",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:37.122881+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.microsoft.com",
      "employee_count": 228000,
      "business_summary": "Microsoft Corporation develops and supports software, services, devices, and solutions worldwide. The company's Productivity and Business Processes segment offers Microsoft 365 Commercial, Enterprise Mobility + Security, Windows Commercial, Power BI, Exchange, SharePoint, Microsoft Teams, Security and Compliance, and Copilot; Microsoft 365 Commercial products, such as Windows Commercial on-premises and Office licensed services; Microsoft 365 Consumer products and cloud services, such as Microsof",
      "market_cap": 2981424267264,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MU",
      "sector": "Technology",
      "industry": "Semiconductors",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:38.262066+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.micron.com",
      "employee_count": 53000,
      "business_summary": "Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Singapore, Japan, Malaysia, China, India, and internationally. It operates through the Cloud Memory Business Unit (CMBU); Core Data Center Business Unit (CDCBU); Mobile and Client Business Unit (MCBU); and Automotive and Embedded Business Unit (AEBU) segments. The company provides memory products, including dynamic random access memory components and modules, CXL-based mem",
      "market_cap": 444227256320,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "NET",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:39.402324+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.cloudflare.com",
      "employee_count": 4838,
      "business_summary": "Cloudflare, Inc. operates as a cloud services provider that delivers a range of services to businesses worldwide. The company provides an integrated cloud-based security solution to secure a range of combination of platforms, including public cloud, private cloud, on-premises, software-as-a-service applications, and Internet of things (IoT) devices; and website and application security products comprising web application firewall, bot management, distributed denial of service protection, API sec",
      "market_cap": 60672200704,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "NFLX",
      "sector": "Communication Services",
      "industry": "Entertainment",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:40.545703+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.netflix.com",
      "employee_count": 16000,
      "business_summary": "Netflix, Inc. provides entertainment services worldwide. The company offers television (TV) series, documentaries, feature films, games, and live programming across various genres and languages. It also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. Netflix, Inc. was incorporated in 1997 and is headquartered in Los Gatos, California.",
      "market_cap": 348683304960,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "NU",
      "sector": "Financial Services",
      "industry": "Banks - Regional",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:41.683746+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "Brazil",
      "website": "https://www.nubank.com.br",
      "employee_count": null,
      "business_summary": "Nu Holdings Ltd. provides digital banking platform in Brazil, Mexico, Colombia, the Cayman Islands, and the United States. It offers spending solutions comprising Nu credit and prepaid card, a digitally enabled card that acts as a credit and a prepaid card; Nubank+ Tier, an evolution of the Nu experience; Ultraviolet credit and prepaid card, a premium metal credit card; mobile payment solutions for NuAccount customers to make and receive transfers, pay bills, and make everyday purchases through ",
      "market_cap": 84313014272,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "NVDA",
      "sector": "Technology",
      "industry": "Semiconductors",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:42.824081+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.nvidia.com",
      "employee_count": 36000,
      "business_summary": "NVIDIA Corporation, a computing infrastructure company, provides graphics and compute and networking solutions in the United States, Singapore, Taiwan, China, Hong Kong, and internationally. The Compute & Networking segment includes its Data Centre accelerated computing platforms and artificial intelligence solutions and software; networking; automotive platforms and autonomous and electric vehicle solutions; Jetson for robotics and other embedded platforms; and DGX Cloud computing services. The",
      "market_cap": 4514177351680,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "O",
      "sector": "Real Estate",
      "industry": "REIT - Retail",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:43.956337+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.realtyincome.com",
      "employee_count": 468,
      "business_summary": "Realty Income Corporation an S&P 500 company is real estate partner to the world's leading companies. Founded in 1969, we serve our clients as a full-service real estate capital provider. As of September 30, 2025, we have a portfolio of over 15,500 properties in all 50 U.S. states, the U.K., and seven other countries in Europe. We are known as The Monthly Dividend Company and have a mission to invest in people and places to deliver dependable monthly dividends that increase over time. Since our ",
      "market_cap": 58051829760,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "OKLO",
      "sector": "Utilities",
      "industry": "Utilities - Independent Power Producers",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:45.090442+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.oklo.com",
      "employee_count": 120,
      "business_summary": "Oklo Inc. develops advanced fission power plants to provide clean, reliable, and affordable energy at scale to the customers in the United States. It also commercializes nuclear fuel recycling technology that converts nuclear waste into useable fuel for its reactors. Oklo Inc. has an joint agreement with newcleo to develop advanced fuel fabrication and manufacturing infrastructure in the United States. Oklo Inc. is based in Santa Clara, California.",
      "market_cap": 11109166080,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ONDS",
      "sector": "Technology",
      "industry": "Communication Equipment",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:46.224658+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NCM",
      "country": "United States",
      "website": "https://www.ondas.com",
      "employee_count": 113,
      "business_summary": "Ondas Inc. provides private wireless, drone, and automated data solutions in the United States and internationally. It operates through two segments: Ondas Networks and Ondas Autonomous Systems. The company designs, develops, manufactures, sells, and supports FullMAX, a software defined radio (SDR) platform for wide-area broadband networks. Its FullMAX SDR platform enables secure and reliable industrial-grade connectivity for truly mission-critical applications. It provides Optimus, an AI-powere",
      "market_cap": 4110489088,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ORCL",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:47.370324+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.oracle.com",
      "employee_count": 162000,
      "business_summary": "Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning ERP, Oracle Fusion cloud enterprise performance management EPM, Oracle Fusion cloud supply chain and manufacturing management SCM, Oracle Fusion cloud human capital management HCM, and NetSuite applications suite, Oracle Health a",
      "market_cap": 410477690880,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "PANW",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:48.510245+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.paloaltonetworks.com",
      "employee_count": 16413,
      "business_summary": "Palo Alto Networks, Inc. provides cybersecurity solutions in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. It offers Prisma Access, a secure access service edge solution; Strata Cloud Manager, a network security management solution; and Prisma AIRS to protect customers' entire AI ecosystem. It provides a comprehensive cloud native application protection platform; and Code to Cloud platform, as well as offers VM-Series and CN-Series virtual firewalls for inline netwo",
      "market_cap": 108972130304,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "PATH",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:49.646523+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.uipath.com",
      "employee_count": 3868,
      "business_summary": "UiPath, Inc. provides an end-to-end automation platform that offers a range of robotic process automation (RPA) solutions primarily in the United States, Romania, the United Kingdom, the Netherlands, and internationally. The company delivers software robots that emulate human actions with precision and speed for organizations to automate repetitive tasks. Its platform's embedded AI, ML, and NLP capabilities improve decisioning and information processing; allows users to design and combine UI aut",
      "market_cap": 6892923904,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "PG",
      "sector": "Consumer Defensive",
      "industry": "Household & Personal Products",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:50.787873+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.pginvestor.com",
      "employee_count": 109000,
      "business_summary": "The Procter & Gamble Company provides branded consumer packaged goods worldwide. It operates through Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care segments. The company offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; antiperspirants, deodorants, and personal cleansing products under the Native, Old Spice, Safeguard, and Secret brands; and facial moisturizers, cleaners, and ",
      "market_cap": 372535066624,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "PL",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:51.927379+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.planet.com",
      "employee_count": 810,
      "business_summary": "Planet Labs PBC engages in the design, construction, and launch constellations of satellites with the intent of providing high cadence geospatial data delivered to customers through an online platform the United States and internationally. The company's platform offers planet monitoring, tasking, archive, apps, application programming interfaces (APIs), basemaps, and fusion, as well as analytic feeds and planetary variables. It also provides Tanager, a hyperspectral imaging satellite that delive",
      "market_cap": 7592664064,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "PLTR",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:53.063605+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.palantir.com",
      "employee_count": null,
      "business_summary": "Palantir Technologies Inc. builds and deploys software platforms for the intelligence community to assist in counterterrorism investigations and operations in the United States, the United Kingdom, and internationally. It provides Palantir Gotham, a software platform, which enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, as well as facilitates the hand-off between analysts and operational users, he",
      "market_cap": 323908993024,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "PM",
      "sector": "Consumer Defensive",
      "industry": "Tobacco",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:54.229979+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.pmi.com",
      "employee_count": 83100,
      "business_summary": "Philip Morris International Inc. operates as a tobacco company. The company offers cigarettes and smoke-free products, including heat-not-burn, vapor, and oral nicotine products under the IQOS and ZYN brands; and consumer accessories, such as lighters and matches. It also offers wellness and healthcare products. Philip Morris International Inc. was incorporated in 1987 and is headquartered in Stamford, Connecticut.",
      "market_cap": 284576579584,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "POWL",
      "sector": "Industrials",
      "industry": "Electrical Equipment & Parts",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:55.368238+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.powellind.com",
      "employee_count": 3143,
      "business_summary": "Powell Industries, Inc., together with its subsidiaries, designs, develops, manufactures, sells, and services custom-engineered equipment and systems. The company's products portfolio includes integrated power control room substations, custom-engineered modules, and electrical houses; and traditional and arc-resistant distribution switchgears and control gears, medium-voltage circuit breakers, monitoring and control communications systems, motor control centers, switches, and bus duct systems. I",
      "market_cap": 7093764096,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "QBTS",
      "sector": "Technology",
      "industry": "Computer Hardware",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:56.510697+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.dwavequantum.com",
      "employee_count": 216,
      "business_summary": "D-Wave Quantum Inc. develops and delivers quantum computing systems, software, and services worldwide. The company offers Advantage and Advantage 2 quantum computers; Ocean, a suite of open-source tools; and Leap quantum cloud service, a cloud-based service that provides real-time access to quantum computers and quantum hybrid solvers; and secure access and data protection services. It also provides Leap hybrid solver service that offers a combination of quantum and classical computation resourc",
      "market_cap": 7662859776,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "QQQ",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:57.651012+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NGM",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "To maintain the correspondence between the composition and weights of the securities in the trust (the \"securities\") and the stocks in the NASDAQ-100 Index®, the adviser adjusts the securities from time to time to conform to periodic changes in the identity and/or relative weights of index securities. The composition and weighting of the securities portion of a portfolio deposit are also adjusted to conform to changes in the index.",
      "market_cap": 239653421056,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RBRK",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:58.783868+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.rubrik.com",
      "employee_count": 3200,
      "business_summary": "Rubrik, Inc. provides data security solutions to individuals and businesses worldwide. The company offers enterprise data protection, unstructured data protection, cloud data protection, SaaS data protection solutions, and identity provider services protection; data threat analytics; data security posture; and cyber recovery solutions. It serves financial, retail, trade, transportation, energy, industrial, healthcare and life science, education, technology, media, communications, services, and p",
      "market_cap": 10221229056,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RDW",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:08:59.923836+00:00",
      "market_cap_category": "small_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://redwirespace.com",
      "employee_count": 1300,
      "business_summary": "Redwire Corporation provides critical space solutions and space infrastructure for government and commercial customers in the United States, Europe, and internationally. The company offers avionics and sensors, including star trackers and sun sensors, which are critical for navigation and control of spacecraft; camera systems; infrared, space situational awareness, and position timing and navigation payloads; solar array solutions for spacecraft spanning the spectrum of size, power needs, and or",
      "market_cap": 1658113920,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RGTI",
      "sector": "Technology",
      "industry": "Computer Hardware",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:01.060163+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NCM",
      "country": "United States",
      "website": "https://www.rigetti.com",
      "employee_count": 137,
      "business_summary": "Rigetti Computing, Inc., through its subsidiaries, builds quantum computers and the superconducting quantum processors the United States, the United Kingdom, rest of Europe, Asia, and internationally. The company offers quantum processing units (QPUs) and quantum computing systems through the cloud in the form of quantum computing as a service (QCaaS) products. It also provides 9- ubit quantum processing unit under the Novera QPU trade name; 84-qubit Ankaa-3 system under the name Novera QPU; and",
      "market_cap": 5844761600,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RIVN",
      "sector": "Consumer Cyclical",
      "industry": "Auto Manufacturers",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:02.242085+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.rivian.com",
      "employee_count": 14861,
      "business_summary": "Rivian Automotive, Inc., together with its subsidiaries, designs, develops, manufactures, and sells electric vehicles and accessories. The company offers consumer vehicles, including a two-row, five-passenger pickup truck under the R1T brand, a three-row, seven-passenger sport utility vehicle under the R1S name. It provides software and services, such as remarketing, vehicle repair and maintenance services, and vehicle electrical architecture and software development services. In addition, the c",
      "market_cap": 18143514624,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RKLB",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:03.431576+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NCM",
      "country": "United States",
      "website": "https://rocketlabcorp.com",
      "employee_count": 2100,
      "business_summary": "Rocket Lab Corporation, a space company, provides launch services and space systems solutions in the United States, Canada, Japan, and internationally. The company provides launch services, spacecraft design services, spacecraft components, spacecraft manufacturing, and other spacecraft and on-orbit management solutions; and constellation management services, as well as designs and manufactures small and medium-class rockets. It also designs, manufactures, and sells Electron, an orbital small la",
      "market_cap": 38630182912,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RR",
      "sector": "Industrials",
      "industry": "Specialty Industrial Machinery",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:04.602030+00:00",
      "market_cap_category": "small_cap",
      "exchange": "NCM",
      "country": "United States",
      "website": "https://www.richtechrobotics.com",
      "employee_count": 55,
      "business_summary": "Richtech Robotics Inc. develops, manufactures, deploys, and sells robotic solutions for automation in the service industry in the United States. The company offers commercial robotic products, including Matradee, a line of restaurant service robots for bussing, serving, hosting, advertising, and entertaining; and ADAM and Scorpion, which are dual-arm AI-powered service robots for beverage preparation and customer interaction in hospitality and retail environments. It also provides industrial rob",
      "market_cap": 760226304,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RTX",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:05.740952+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.rtx.com",
      "employee_count": 180000,
      "business_summary": "RTX Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers in the United States and internationally. It operates through three segments: Collins Aerospace, Pratt & Whitney, and Raytheon. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for civil and military aircraft manufacturers and commercial airlines, as well as regional, business, and general aviation, d",
      "market_cap": 266357768192,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SCHD",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:06.876029+00:00",
      "market_cap_category": "unknown",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "To pursue its goal, the fund generally invests in stocks that are included in the index. The index is designed to measure the performance of high dividend yielding stocks issued by U.S. companies that have a record of consistently paying dividends, selected for fundamental strength relative to their peers, based on financial ratios. The fund will invest at least 90% of its net assets in these stocks.",
      "market_cap": 0,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SE",
      "sector": "Consumer Cyclical",
      "industry": "Internet Retail",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:08.026219+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "Singapore",
      "website": "https://www.sea.com",
      "employee_count": 80700,
      "business_summary": "Sea Limited, through its subsidiaries, operates as a consumer internet company in Southeast Asia, Latin America, the rest of Asia, and internationally. The company operates through E-commerce, Digital financial services, and Digital entertainment segments. It offers Garena, a digital entertainment platform for users to access mobile and PC online games, as well as promotes eSports operations and develops games. The company also operates the Shopee e-commerce platform, a mobile-centric marketplac",
      "market_cap": 64257839104,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SLV",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:09.199878+00:00",
      "market_cap_category": "large_cap",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The Trust seeks to reflect such performance before payment of the Trust's expenses and liabilities. It is not actively managed. The Trust does not engage in any activities designed to obtain a profit from, or to ameliorate losses caused by, changes in the price of silver.",
      "market_cap": 23966375936,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SMCI",
      "sector": "Technology",
      "industry": "Computer Hardware",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:10.369193+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.supermicro.com",
      "employee_count": 6238,
      "business_summary": "Super Micro Computer, Inc., together with its subsidiaries, develops and sells server and storage solutions based on modular and open-standard architecture in the United States, Asia, Europe, and internationally. The company offers liquid and air-cooled AI servers for training and inferencing with integrated graphics processing units (GPUs) or PCIe based architectures; SuperBlade, MicroBlade, FlexTwin, GrandTwin, and BigTwin blade and multi-node systems; SuperStorage systems; Hyper, CloudDC, and",
      "market_cap": 20523868160,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SMR",
      "sector": "Industrials",
      "industry": "Specialty Industrial Machinery",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:11.517684+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.nuscalepower.com",
      "employee_count": 330,
      "business_summary": "NuScale Power Corporation provides small modular reactor technology solutions. It offers NuScale Power Module (NPM), a water reactor that can generate 77 megawatts of electricity (MWe). The company was founded in 2007 and is headquartered in Corvallis, Oregon.",
      "market_cap": 4958246400,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SNDK",
      "sector": "Technology",
      "industry": "Computer Hardware",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:12.654020+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.sandisk.com",
      "employee_count": 11000,
      "business_summary": "Sandisk Corporation develops, manufactures, and sells data storage devices and solutions using NAND flash technology in the United States, Europe, the Middle East, Africa, Asia, and internationally. The company offers solid state drives for desktop and notebook PCs, gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs and other portable and wearable devices, automotive applications, Internet of Things, industrial, and connected ho",
      "market_cap": 88237834240,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SOFI",
      "sector": "Financial Services",
      "industry": "Credit Services",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:13.804411+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.sofi.com",
      "employee_count": null,
      "business_summary": "SoFi Technologies, Inc. provides various financial services in the United States, Latin America, Canada, and Hong Kong. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money; and personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to fi",
      "market_cap": 26359900160,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SPY",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:14.938225+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The trust seeks to achieve its investment objective by holding a portfolio of the common stocks that are included in the index (the “Portfolio”), with the weight of each stock in the Portfolio substantially corresponding to the weight of such stock in the index.",
      "market_cap": 633838632960,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "TMDX",
      "sector": "Healthcare",
      "industry": "Medical Devices",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:16.083399+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NGM",
      "country": "United States",
      "website": "https://www.transmedics.com",
      "employee_count": 728,
      "business_summary": "TransMedics Group, Inc., a commercial-stage medical technology company, engages in transforming organ transplant therapy for end-stage organ failure patients in the United States and internationally. The company offers Organ Care System (OCS), a portable organ perfusion, optimization, and monitoring system that utilizes its proprietary and customized technology to replicate near-physiologic conditions for donor organs outside of the human body. Its OCS includes OCS LUNG for the preservation of s",
      "market_cap": 4615584256,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "TRV",
      "sector": "Financial Services",
      "industry": "Insurance - Property & Casualty",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:17.221007+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.travelers.com",
      "employee_count": 30000,
      "business_summary": "The Travelers Companies, Inc., through its subsidiaries, provides a range of commercial and personal property, and casualty insurance products and services to businesses, government units, associations, and individuals in the United States and internationally. The company operates through three segments: Business Insurance, Bond & Specialty Insurance, and Personal Insurance. The Business Insurance segment offers workers' compensation, commercial automobile and property, general liability, commer",
      "market_cap": 67251388416,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "TSLA",
      "sector": "Consumer Cyclical",
      "industry": "Auto Manufacturers",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:18.385795+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.tesla.com",
      "employee_count": 134785,
      "business_summary": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive; and Energy Generation and Storage. The company offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty maintenance services and collision, automotive insurance services, as well as part sales and retail merchandise sale. It also provides sed",
      "market_cap": 1542662258688,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "TSM",
      "sector": "Technology",
      "industry": "Semiconductors",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:19.522273+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "Taiwan",
      "website": "https://www.tsmc.com",
      "employee_count": null,
      "business_summary": "Taiwan Semiconductor Manufacturing Company Limited, together with its subsidiaries, manufactures, packages, tests, and sells integrated circuits and other semiconductor devices in Taiwan, China, Europe, the Middle East, Africa, Japan, the United States, and internationally. It provides various wafer fabrication processes, such as processes to manufacture complementary metal- oxide-semiconductor (CMOS) logic, mixed-signal, radio frequency, embedded memory, bipolar CMOS mixed-signal, and others. T",
      "market_cap": 1809312251904,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "UMAC",
      "sector": "Technology",
      "industry": "Computer Hardware",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:20.657573+00:00",
      "market_cap_category": "small_cap",
      "exchange": "ASE",
      "country": "United States",
      "website": "https://www.unusualmachines.com",
      "employee_count": 16,
      "business_summary": "Unusual Machines, Inc. engages in the commercial drone industry. The company offers small drones and essential components. It distributes their products through B2B sale, e-commerce site, and retail channel. The company was formerly known as AerocarveUS Corporation and changed its name to Unusual Machines, Inc. in July 2022. Unusual Machines, Inc. was incorporated in 2019 and is headquartered in Orlando, Florida.",
      "market_cap": 486663584,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "UNG",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:21.797548+00:00",
      "market_cap_category": "micro_cap",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The fund invests primarily in futures contracts for natural gas that are traded on the NYMEX, ICE Futures Europe and ICE Futures U.S. (together, “ICE Futures”) or other U.S. and foreign exchanges. The Benchmark Futures Contract is the futures contract on natural gas as traded on the New York Mercantile Exchange that is the near month contract to expire, except when the near month contract is within two weeks of expiration.",
      "market_cap": 160362640,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "UNH",
      "sector": "Healthcare",
      "industry": "Healthcare Plans",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:22.938180+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.unitedhealthgroup.com",
      "employee_count": null,
      "business_summary": "UnitedHealth Group Incorporated operates as a health care company in the United States and internationally. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older; Medi",
      "market_cap": 250600243200,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "USO",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:24.079206+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "USO invests primarily in futures contracts for light, sweet crude oil, other types of crude oil, diesel-heating oil, gasoline, natural gas, and other petroleum-based fuels.",
      "market_cap": 9169508352,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "UUUU",
      "sector": "Energy",
      "industry": "Uranium",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:25.215123+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "ASE",
      "country": "United States",
      "website": "https://www.energyfuels.com",
      "employee_count": 1370,
      "business_summary": "Energy Fuels Inc., together with its subsidiaries, engages in the exploration, recovery, recycling, exploration, operation, development, permitting, evaluation, and sale of uranium mineral properties in the United States. It produces and sells vanadium pentoxide, rare earth elements, carbonate, and heavy mineral sands, such as ilmenite, rutile, zircon, and monazite. The company was formerly known as Volcanic Metals Exploration Inc. and changed its name to Energy Fuels Inc. in May 2006. Energy Fu",
      "market_cap": 5110359040,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "V",
      "sector": "Financial Services",
      "industry": "Credit Services",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:26.348146+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.visa.com",
      "employee_count": null,
      "business_summary": "Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a platform which facilitates money movement, enabling clients to collect, hold, convert, and send funds across its network; and issuing solutio",
      "market_cap": 639299354624,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "VIG",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:27.481713+00:00",
      "market_cap_category": "unknown",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The adviser employs an indexing investment approach designed to track the performance of the index, which consists of common stocks of companies that have a record of increasing dividends over time. The adviser attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
      "market_cap": 0,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "VNQ",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:28.646719+00:00",
      "market_cap_category": "large_cap",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The advisor attempts to track the index by investing all, or substantially all, of its assets-either directly or indirectly through a wholly owned subsidiary, which is itself a registered investment company-in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index. The fund is non-diversified.",
      "market_cap": 34149195776,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "VRT",
      "sector": "Industrials",
      "industry": "Electrical Equipment & Parts",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:29.781430+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.vertiv.com",
      "employee_count": 31000,
      "business_summary": "Vertiv Holdings Co designs, manufactures, and services critical digital infrastructure technologies and life cycle services for data centers, communication networks, and commercial and industrial environments in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. The company offers AC and DC power management products, switchgear and busbar products, thermal management products, integrated rack systems, modular solutions, and management systems for monitoring and controlling digi",
      "market_cap": 74777722880,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "VST",
      "sector": "Utilities",
      "industry": "Utilities - Independent Power Producers",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:31.071058+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://vistracorp.com",
      "employee_count": 6850,
      "business_summary": "Vistra Corp., together with its subsidiaries, operates as an integrated retail electricity and power generation company in the United States. It operates through five segments: Retail, Texas, East, West, and Asset Closure. The company retails electricity and natural gas to residential, commercial, and industrial customers across states in the United States and the District of Columbia. It also involved in the electricity generation, wholesale energy purchases and sales, commodity risk management",
      "market_cap": 50705235968,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "VTV",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:32.206802+00:00",
      "market_cap_category": "large_cap",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The manager employs an indexing investment approach designed to track the performance of the index, a broadly diversified index predominantly made up of value stocks of large U.S. companies. The manager attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
      "market_cap": 87561166848,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "VUG",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:33.374659+00:00",
      "market_cap_category": "large_cap",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The fund employs an indexing investment approach designed to track the performance of the index, a broadly diversified index predominantly made up of growth stocks of large U.S. companies. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
      "market_cap": 113430175744,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "VYM",
      "sector": "Unknown",
      "industry": "Unknown Industry",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:34.511325+00:00",
      "market_cap_category": "unknown",
      "exchange": "PCX",
      "country": "US",
      "website": "",
      "employee_count": null,
      "business_summary": "The manager employs an indexing investment approach designed to track the performance of the index, which consists of common stocks of companies that pay dividends that generally are higher than average. The adviser attempts to replicate the target index by investing all, or substantially all, of the fund's assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
      "market_cap": 0,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "WFC",
      "sector": "Financial Services",
      "industry": "Banks - Diversified",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:35.650038+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.wellsfargo.com",
      "employee_count": 205198,
      "business_summary": "Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. It operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financ",
      "market_cap": 294979764224,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "WMT",
      "sector": "Consumer Defensive",
      "industry": "Discount Stores",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:36.783541+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.walmart.com",
      "employee_count": 2100000,
      "business_summary": "Walmart Inc. engages in the operation of retail and wholesale stores and clubs, eCommerce websites, and mobile applications worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, warehouse clubs, cash and carry stores, and discount stores under Walmart and Walmart Neighborhood Market brands; membership-only warehouse clubs; and ecommerce websites, such as walmart.com.mx, walmart.ca, flipkart.com, PhoneP",
      "market_cap": 1045878538240,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "WULF",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:37.922739+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NCM",
      "country": "United States",
      "website": "https://www.terawulf.com",
      "employee_count": 12,
      "business_summary": "TeraWulf Inc., together with its subsidiaries, operates as a digital asset technology company in the United States. The company develops, owns, and operates bitcoin mining facilities in New York and Pennsylvania. It is involved in the provision of miner hosting services to third-party entities. The company was founded in 2021 and is headquartered in Easton, Maryland.",
      "market_cap": 5982964224,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "XOM",
      "sector": "Energy",
      "industry": "Oil & Gas Integrated",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:39.056539+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://corporate.exxonmobil.com",
      "employee_count": null,
      "business_summary": "Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States, Guyana, Canada, the United Kingdom, Singapore, France, and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. The Chemical Products segment manuf",
      "market_cap": 628568555520,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ZETA",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:40.198297+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.zetaglobal.com",
      "employee_count": 2191,
      "business_summary": "Zeta Global Holdings Corp. operates an omnichannel data-driven cloud platform that provides enterprises with consumer intelligence and marketing automation software in the United States and internationally. The company's Zeta Marketing platform analyzes billions of structured and unstructured data signals to predict consumer intent by leveraging sophisticated machine learning algorithms and the industry's opted-in data set for omnichannel marketing; and Consumer Data platform (CDP+) delivers rea",
      "market_cap": 4153527040,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ZS",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-07T03:09:41.368044+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.zscaler.com",
      "employee_count": 7923,
      "business_summary": "Zscaler, Inc. operates as a cloud security company worldwide. The company offers cyberthreat protection products, including Zscaler Internet Access, which provides threat protection, cloud sandbox, and cloud browser isolation; Zscaler Private Access solution that includes cyberthreat and data protection, application discovery, secure application access, application segmentation, application protection, reduced attack surface, and browser isolation; Zero Trust Firewall; Cloud Sandbox; and Zero Tr",
      "market_cap": 26684315648,
      "api_source": "yfinance_python"
    }
  ],
  "sector_grouping": {
    "Healthcare": [
      "ABBV",
      "HIMS",
      "JNJ",
      "MRK",
      "TMDX",
      "UNH"
    ],
    "Industrials": [
      "ACHR",
      "AVAV",
      "AXON",
      "BA",
      "BE",
      "BWXT",
      "CAT",
      "EOSE",
      "ETN",
      "GEV",
      "HON",
      "JOBY",
      "KTOS",
      "LUNR",
      "MMM",
      "PL",
      "POWL",
      "RDW",
      "RKLB",
      "RR",
      "RTX",
      "SMR",
      "VRT"
    ],
    "Technology": [
      "ADBE",
      "ALAB",
      "AMD",
      "ASTS",
      "AVGO",
      "CHYM",
      "CRM",
      "CRWD",
      "CRWV",
      "CSCO",
      "DDOG",
      "DUOL",
      "FIG",
      "GRAB",
      "IBM",
      "INTU",
      "IONQ",
      "KSPI",
      "LRCX",
      "MDB",
      "MSFT",
      "MU",
      "NET",
      "NVDA",
      "ONDS",
      "ORCL",
      "PANW",
      "PATH",
      "PLTR",
      "QBTS",
      "RBRK",
      "RGTI",
      "SMCI",
      "SNDK",
      "TSM",
      "UMAC",
      "ZETA",
      "ZS"
    ],
    "Consumer Cyclical": [
      "AMZN",
      "HD",
      "MCD",
      "MELI",
      "RIVN",
      "SE",
      "TSLA"
    ],
    "Communication Services": [
      "APP",
      "GOOG",
      "META",
      "NFLX"
    ],
    "Financial Services": [
      "AXP",
      "BAC",
      "BRK-B",
      "CIFR",
      "CLSK",
      "COIN",
      "CRCL",
      "GS",
      "HOOD",
      "HUT",
      "IBKR",
      "INTR",
      "IREN",
      "JPM",
      "MA",
      "MAIN",
      "NU",
      "SOFI",
      "TRV",
      "V",
      "WFC",
      "WULF"
    ],
    "Energy": [
      "CCJ",
      "CVX",
      "LEU",
      "UUUU",
      "XOM"
    ],
    "Utilities": [
      "CEG",
      "OKLO",
      "VST"
    ],
    "Consumer Defensive": [
      "COST",
      "KO",
      "PG",
      "PM",
      "WMT"
    ],
    "Unknown": [
      "D-WAVE",
      "DGRO",
      "DIA",
      "DIVO",
      "GLD",
      "IWM",
      "JEPI",
      "JEPQ",
      "QQQ",
      "SCHD",
      "SLV",
      "SPY",
      "UNG",
      "USO",
      "VIG",
      "VNQ",
      "VTV",
      "VUG",
      "VYM"
    ],
    "Basic Materials": [
      "MP"
    ],
    "Real Estate": [
      "O"
    ]
  },
  "confidence_distribution": {
    "high_confidence_1_0": 133,
    "fallback_confidence_0_8": 1
  },
  "data_sources": {
    "yfinance_python": 133,
    "fallback_data": 1
  },
  "refresh_metadata": {
    "symbols_updated": 134,
    "symbols_success": 133,
    "symbols_fallback": 1,
    "update_source": "github_actions_python"
  }
}