{
  "ttl_days": 7,
  "as_of": "2026-02-05T03:15:11.374288+00:00",
  "next_refresh": "2026-02-05T00:20:00+00:00",
  "items": [
    {
      "symbol": "ASTS",
      "sector": "Technology",
      "industry": "Communication Equipment",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:13:50.539585+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://ast-science.com",
      "employee_count": 578,
      "business_summary": "AST SpaceMobile, Inc., together with its subsidiaries, designs and develops the constellation of BlueBird satellites in the United States. The company provides a cellular broadband network in space to be accessible directly by smartphones for commercial use and other applications, as well as for government use. Its SpaceMobile service provides cellular broadband services to end-users who are out of terrestrial cellular coverage. The company was founded in 2017 and is headquartered in Midland, Te",
      "market_cap": 38026035200,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RIVN",
      "sector": "Consumer Cyclical",
      "industry": "Auto Manufacturers",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:13:51.668086+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.rivian.com",
      "employee_count": 14861,
      "business_summary": "Rivian Automotive, Inc., together with its subsidiaries, designs, develops, manufactures, and sells electric vehicles and accessories. The company offers consumer vehicles, including a two-row, five-passenger pickup truck under the R1T brand, a three-row, seven-passenger sport utility vehicle under the R1S name. It provides software and services, such as remarketing, vehicle repair and maintenance services, and vehicle electrical architecture and software development services. In addition, the c",
      "market_cap": 17616371712,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "PL",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:13:52.842535+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.planet.com",
      "employee_count": 810,
      "business_summary": "Planet Labs PBC engages in the design, construction, and launch constellations of satellites with the intent of providing high cadence geospatial data delivered to customers through an online platform the United States and internationally. The company's platform offers planet monitoring, tasking, archive, apps, application programming interfaces (APIs), basemaps, and fusion, as well as analytic feeds and planetary variables. It also provides Tanager, a hyperspectral imaging satellite that delive",
      "market_cap": 7296023040,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ONDS",
      "sector": "Technology",
      "industry": "Communication Equipment",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:13:54.024012+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NCM",
      "country": "United States",
      "website": "https://www.ondas.com",
      "employee_count": 113,
      "business_summary": "Ondas Inc. provides private wireless, drone, and automated data solutions in the United States and internationally. It operates through two segments: Ondas Networks and Ondas Autonomous Systems. The company designs, develops, manufactures, sells, and supports FullMAX, a software defined radio (SDR) platform for wide-area broadband networks. Its FullMAX SDR platform enables secure and reliable industrial-grade connectivity for truly mission-critical applications. It provides Optimus, an AI-powere",
      "market_cap": 4106247424,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RDW",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:13:55.182748+00:00",
      "market_cap_category": "small_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://redwirespace.com",
      "employee_count": 1300,
      "business_summary": "Redwire Corporation provides critical space solutions and space infrastructure for government and commercial customers in the United States, Europe, and internationally. The company offers avionics and sensors, including star trackers and sun sensors, which are critical for navigation and control of spacecraft; camera systems; infrared, space situational awareness, and position timing and navigation payloads; solar array solutions for spacecraft spanning the spectrum of size, power needs, and or",
      "market_cap": 1656462336,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "AVAV",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:13:56.416043+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.avinc.com",
      "employee_count": 1456,
      "business_summary": "AeroVironment, Inc. designs, develops, produces, delivers, and supports a portfolio of robotic systems and related services for government agencies and businesses in the United States and internationally. It operates in two segments, Autonomous Systems; and Space, Cyber and Directed Energy. The company provides uncrewed aircraft systems (UAS), which include small and medium UAS, and kinesis command and control software; and counter-UAS and precision strike, a loitering munitions solution that de",
      "market_cap": 12847556608,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MDB",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:13:57.554520+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NGM",
      "country": "United States",
      "website": "https://www.mongodb.com",
      "employee_count": 5639,
      "business_summary": "MongoDB, Inc., together with its subsidiaries, provides general purpose database platform worldwide. The company provides MongoDB Atlas, a hosted multi-cloud database-as-a-service solution; MongoDB Enterprise Advanced, a commercial database server for enterprise customers to run in the cloud, on-premises, or in a hybrid environment; and Community Server, a free-to-download version of its database, which includes the functionality that developers need to get started with MongoDB. It offers profes",
      "market_cap": 27477858304,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ORCL",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:13:58.837106+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.oracle.com",
      "employee_count": 162000,
      "business_summary": "Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning ERP, Oracle Fusion cloud enterprise performance management EPM, Oracle Fusion cloud supply chain and manufacturing management SCM, Oracle Fusion cloud human capital management HCM, and NetSuite applications suite, Oracle Health a",
      "market_cap": 421542920192,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "TSM",
      "sector": "Technology",
      "industry": "Semiconductors",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:13:59.989830+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NYQ",
      "country": "Taiwan",
      "website": "https://www.tsmc.com",
      "employee_count": null,
      "business_summary": "Taiwan Semiconductor Manufacturing Company Limited, together with its subsidiaries, manufactures, packages, tests, and sells integrated circuits and other semiconductor devices in Taiwan, China, Europe, the Middle East, Africa, Japan, the United States, and internationally. It provides various wafer fabrication processes, such as processes to manufacture complementary metal- oxide-semiconductor (CMOS) logic, mixed-signal, radio frequency, embedded memory, bipolar CMOS mixed-signal, and others. T",
      "market_cap": 1689452019712,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RKLB",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:01.144616+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NCM",
      "country": "United States",
      "website": "https://rocketlabcorp.com",
      "employee_count": 2100,
      "business_summary": "Rocket Lab Corporation, a space company, provides launch services and space systems solutions in the United States, Canada, Japan, and internationally. The company provides launch services, spacecraft design services, spacecraft components, spacecraft manufacturing, and other spacecraft and on-orbit management solutions; and constellation management services, as well as designs and manufactures small and medium-class rockets. It also designs, manufactures, and sells Electron, an orbital small la",
      "market_cap": 39052169216,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CRM",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:02.314827+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.salesforce.com",
      "employee_count": 76453,
      "business_summary": "Salesforce, Inc. provides customer relationship management technology that connects companies and customers together worldwide. The company offers Agentforce, an agentic layer of the salesforce platform; Data Cloud, a data engine; Industries AI for creating industry-specific AI agents with Agentforce; Salesforce Starter, a suite of solution for small and medium-size business; Slack, a workplace communication and productivity platform; Tableau, an end-to-end analytics solution for range of enterp",
      "market_cap": 189866885120,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "NVDA",
      "sector": "Technology",
      "industry": "Semiconductors",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:03.509190+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.nvidia.com",
      "employee_count": 36000,
      "business_summary": "NVIDIA Corporation, a computing infrastructure company, provides graphics and compute and networking solutions in the United States, Singapore, Taiwan, China, Hong Kong, and internationally. The Compute & Networking segment includes its Data Centre accelerated computing platforms and artificial intelligence solutions and software; networking; automotive platforms and autonomous and electric vehicle solutions; Jetson for robotics and other embedded platforms; and DGX Cloud computing services. The",
      "market_cap": 4241004167168,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "AVGO",
      "sector": "Technology",
      "industry": "Semiconductors",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:04.682969+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.broadcom.com",
      "employee_count": 33000,
      "business_summary": "Broadcom Inc. designs, develops, and supplies various semiconductor devices and infrastructure software solutions internationally. The company operates in two segments: Semiconductor Solutions and Infrastructure Software. The company offers networking connectivity, such as custom silicon solutions, ethernet switching & routing, ethernet NIC controllers, physical layer devices, and fiber optic components; wireless device connectivity, including RF semiconductor devices, connectivity solutions, cu",
      "market_cap": 1460549320704,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "AMZN",
      "sector": "Consumer Cyclical",
      "industry": "Internet Retail",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:05.864868+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.amazon.com",
      "employee_count": 1578000,
      "business_summary": "Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, fire tablets, fire TVs, echo, ring, blink, and eero; and develops and produces media content. In addition, the company offers programs that enable ",
      "market_cap": 2490713505792,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "GOOG",
      "sector": "Communication Services",
      "industry": "Internet Content & Information",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:07.027750+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://abc.xyz",
      "employee_count": 190167,
      "business_summary": "Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the ",
      "market_cap": 4024024956928,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "META",
      "sector": "Communication Services",
      "industry": "Internet Content & Information",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:08.175073+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.meta.com",
      "employee_count": 78865,
      "business_summary": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality (VR) headsets, and AI glasses in the United States, Canada, Europe, Asia-Pacific, and internationally. It operates through two segments, Family of Apps (FoA) and Reality Labs (RL). The FoA segment offers Facebook, which enables people to build community through feed, reels, stories, groups, marketplace, and other; ",
      "market_cap": 1692247261184,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "NFLX",
      "sector": "Communication Services",
      "industry": "Entertainment",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:09.489230+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.netflix.com",
      "employee_count": 16000,
      "business_summary": "Netflix, Inc. provides entertainment services worldwide. The company offers television (TV) series, documentaries, feature films, games, and live programming across various genres and languages. It also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. Netflix, Inc. was incorporated in 1997 and is headquartered in Los Gatos, California.",
      "market_cap": 340029865984,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "LEU",
      "sector": "Energy",
      "industry": "Uranium",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:10.637117+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.centrusenergy.com",
      "employee_count": 322,
      "business_summary": "Centrus Energy Corp. supplies nuclear fuel components for the nuclear power industry in the United States, Belgium, Japan, the Netherlands, and internationally. The company operates in two segments, Low-Enriched Uranium (LEU) and Technical Solutions. The LEU segment sells separative work units (SWU) components of LEU; natural uranium hexafluoride, uranium concentrates, and uranium conversion; and enriched uranium products to utilities that operate nuclear power plants. The Technical Solutions se",
      "market_cap": 4579051008,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SMR",
      "sector": "Industrials",
      "industry": "Specialty Industrial Machinery",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:11.839728+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.nuscalepower.com",
      "employee_count": 330,
      "business_summary": "NuScale Power Corporation provides small modular reactor technology solutions. It offers NuScale Power Module (NPM), a water reactor that can generate 77 megawatts of electricity (MWe). The company was founded in 2007 and is headquartered in Corvallis, Oregon.",
      "market_cap": 4582064640,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CRWV",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:13.005299+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.coreweave.com",
      "employee_count": 881,
      "business_summary": "CoreWeave, Inc. operates a cloud platform that provides scaling, support, and acceleration for GenAI. The company builds the infrastructure that supports compute workloads for enterprises. Its products include GPU compute, CPU compute, storage services, networking services, managed services, and virtual and bare metal servers. The company's platform offers a fleet lifecycle controller, node lifecycle controller, tensorizer, and observability. Its services also include VFX and rendering, AI model",
      "market_cap": 42982543360,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "IONQ",
      "sector": "Technology",
      "industry": "Computer Hardware",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:14.175571+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://ionq.com",
      "employee_count": 407,
      "business_summary": "IonQ, Inc. develops quantum computers and networks in the United States. It sells access to quantum computers of various qubit capacities. The company also makes access to its quantum computers through cloud platforms, such as Amazon Web Services (AWS) Amazon Braket, Microsoft's Azure Quantum, and Google's Cloud Marketplace, as well as through its cloud service. The company engages in quantum-safe networking and quantum detection systems. It offers quantum key distribution systems, quantum rando",
      "market_cap": 12699808768,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "PLTR",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:15.339583+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.palantir.com",
      "employee_count": null,
      "business_summary": "Palantir Technologies Inc. builds and deploys software platforms for the intelligence community to assist in counterterrorism investigations and operations in the United States, the United Kingdom, and internationally. It provides Palantir Gotham, a software platform, which enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, as well as facilitates the hand-off between analysts and operational users, he",
      "market_cap": 332584681472,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "HIMS",
      "sector": "Healthcare",
      "industry": "Drug Manufacturers - Specialty & Generic",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:16.480162+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.hims.com",
      "employee_count": 1637,
      "business_summary": "Hims & Hers Health, Inc. operates a telehealth platform that connects consumers to licensed healthcare professionals in the United States, the United Kingdom, Canada, and internationally. The company offers a range of curated prescription and non-prescription health and wellness products and services available to purchase on its websites and mobile application directly by customers. It also provides prescription medication on a recurring basis and ongoing care from healthcare providers; and over",
      "market_cap": 5554623488,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "TSLA",
      "sector": "Consumer Cyclical",
      "industry": "Auto Manufacturers",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:17.618336+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.tesla.com",
      "employee_count": 134785,
      "business_summary": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive; and Energy Generation and Storage. The company offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty maintenance services and collision, automotive insurance services, as well as part sales and retail merchandise sale. It also provides sed",
      "market_cap": 1523524960256,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "VST",
      "sector": "Utilities",
      "industry": "Utilities - Independent Power Producers",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:18.788002+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://vistracorp.com",
      "employee_count": 6850,
      "business_summary": "Vistra Corp., together with its subsidiaries, operates as an integrated retail electricity and power generation company in the United States. It operates through five segments: Retail, Texas, East, West, and Asset Closure. The company retails electricity and natural gas to residential, commercial, and industrial customers across states in the United States and the District of Columbia. It also involved in the electricity generation, wholesale energy purchases and sales, commodity risk management",
      "market_cap": 48289411072,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "KTOS",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:19.973527+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.kratosdefense.com",
      "employee_count": 4000,
      "business_summary": "Kratos Defense & Security Solutions, Inc., a technology company, provides technology, products, and system and software for the defense, national security, and commercial markets in the United States, other North America, the Asia Pacific, the Middle East, Europe, and Internationally. The company operates in two segments, Kratos Government Solutions and Unmanned Systems. It offers ground systems for satellites and space vehicles, including software for command and control, telemetry, and trackin",
      "market_cap": 15420221440,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MELI",
      "sector": "Consumer Cyclical",
      "industry": "Internet Retail",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:21.130536+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "Uruguay",
      "website": "https://www.mercadolibre.com",
      "employee_count": 84207,
      "business_summary": "MercadoLibre, Inc. operates online commerce platforms in Brazil, Mexico, Argentina, and internationally. The company operates Mercado Libre Marketplace, an online commerce platform that can be accessed through mobile app or website; and Mercado Pago, a financial technology solution platform, which offers comprehensive set of financial technology services to users and other users of its e-commerce platform. It also provides Mercado Fondo that allows users to invest funds deposited in their Mercad",
      "market_cap": 104070168576,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SOFI",
      "sector": "Financial Services",
      "industry": "Credit Services",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:22.301773+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.sofi.com",
      "employee_count": null,
      "business_summary": "SoFi Technologies, Inc. provides various financial services in the United States, Latin America, Canada, and Hong Kong. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money; and personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to fi",
      "market_cap": 26220898304,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RBRK",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:23.431883+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.rubrik.com",
      "employee_count": 3200,
      "business_summary": "Rubrik, Inc. provides data security solutions to individuals and businesses worldwide. The company offers enterprise data protection, unstructured data protection, cloud data protection, SaaS data protection solutions, and identity provider services protection; data threat analytics; data security posture; and cyber recovery solutions. It serves financial, retail, trade, transportation, energy, industrial, healthcare and life science, education, technology, media, communications, services, and p",
      "market_cap": 10381341696,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "EOSE",
      "sector": "Industrials",
      "industry": "Electrical Equipment & Parts",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:24.591522+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NCM",
      "country": "United States",
      "website": "https://www.eose.com",
      "employee_count": 430,
      "business_summary": "Eos Energy Enterprises, Inc. designs, develops, manufactures, and markets energy storage solutions for utility-scale, microgrid, and commercial and industrial applications in the United States. The company offers Znyth technology battery energy storage system (BESS), which provides the operating flexibility to manage increased grid complexity and price volatility. It also provides Z3 battery module that provides utilities, independent power producers, renewables developers, and commercial and in",
      "market_cap": 4018817280,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CEG",
      "sector": "Utilities",
      "industry": "Utilities - Independent Power Producers",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:25.728701+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.constellationenergy.com",
      "employee_count": 14215,
      "business_summary": "Constellation Energy Corporation produces and sells energy products and services in the United States. It operates through five segments: Mid-Atlantic, Midwest, New York, ERCOT, and Other Power Regions. The company offers electricity, natural gas, energy-related products, and sustainable solutions. It has approximately 31,676 megawatts of generating capacity consisting of nuclear, wind, solar, natural gas, and hydroelectric assets. The company serves distribution utilities, municipalities, coope",
      "market_cap": 90739179520,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "TMDX",
      "sector": "Healthcare",
      "industry": "Medical Devices",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:26.890727+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NGM",
      "country": "United States",
      "website": "https://www.transmedics.com",
      "employee_count": 728,
      "business_summary": "TransMedics Group, Inc., a commercial-stage medical technology company, engages in transforming organ transplant therapy for end-stage organ failure patients in the United States and internationally. The company offers Organ Care System (OCS), a portable organ perfusion, optimization, and monitoring system that utilizes its proprietary and customized technology to replicate near-physiologic conditions for donor organs outside of the human body. Its OCS includes OCS LUNG for the preservation of s",
      "market_cap": 4455306240,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "GRAB",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:28.031502+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "Singapore",
      "website": "https://www.grab.com/sg",
      "employee_count": 11267,
      "business_summary": "Grab Holdings Limited engages in the provision of superapps in Cambodia, Indonesia, Malaysia, Myanmar, the Philippines, Singapore, Thailand, and Vietnam. It operates through four segments: Deliveries, Mobility, Financial services, and Others. The company offers its Grab ecosystem, a single platform with superapps for driver- and merchant-partners and consumers, that allows access to mobility, delivery, and digital financial services. It also provides digital banking services. Grab Holdings Limit",
      "market_cap": 17124530176,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RBLX",
      "sector": "Communication Services",
      "industry": "Electronic Gaming & Multimedia",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:29.199491+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://corp.roblox.com",
      "employee_count": 2474,
      "business_summary": "Roblox Corporation operates an immersive platform for connection and communication in the United States and internationally. It offers Roblox Client, an application that allows users to explore 3D experience; Roblox Studio, a free toolset that allows developers and creators to build, publish, and operate 3D experiences and other content; and Roblox Cloud, which provides services and infrastructure that power the platform. Roblox Corporation was incorporated in 2004 and is headquartered in San Ma",
      "market_cap": 44270440448,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "IREN",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:30.398692+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "Australia",
      "website": "https://iren.com",
      "employee_count": 257,
      "business_summary": "IREN Limited operates in the vertically integrated data center business in Australia and Canada. The company owns and operates computing hardware, as well as electrical infrastructure and data centers. It also mines Bitcoin, a scarce digital asset that is created and transmitted through the operation of a peer-to-peer network of computers running the Bitcoin software. The company was formerly known as Iris Energy Limited and changed its name to IREN Limited in November 2024. The company was inco",
      "market_cap": 14755675136,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "OKLO",
      "sector": "Utilities",
      "industry": "Utilities - Independent Power Producers",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:31.539647+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.oklo.com",
      "employee_count": 120,
      "business_summary": "Oklo Inc. develops advanced fission power plants to provide clean, reliable, and affordable energy at scale to the customers in the United States. It also commercializes nuclear fuel recycling technology that converts nuclear waste into useable fuel for its reactors. Oklo Inc. has an joint agreement with newcleo to develop advanced fuel fabrication and manufacturing infrastructure in the United States. Oklo Inc. is based in Santa Clara, California.",
      "market_cap": 10660738048,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "PATH",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:32.729874+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.uipath.com",
      "employee_count": 3868,
      "business_summary": "UiPath, Inc. provides an end-to-end automation platform that offers a range of robotic process automation (RPA) solutions primarily in the United States, Romania, the United Kingdom, the Netherlands, and internationally. The company delivers software robots that emulate human actions with precision and speed for organizations to automate repetitive tasks. Its platform's embedded AI, ML, and NLP capabilities improve decisioning and information processing; allows users to design and combine UI aut",
      "market_cap": 6593463808,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "INTR",
      "sector": "Financial Services",
      "industry": "Banks - Regional",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:33.871076+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NMS",
      "country": "Brazil",
      "website": "https://inter.co",
      "employee_count": null,
      "business_summary": "Inter & Co, Inc., through its subsidiaries, engages in the banking and spending, investments, insurance brokerage, and inter shop businesses in Brazil and the United States. The company offers banking products and services, including checking accounts; cards; deposits; loans and advances; and other services, as well as debt collection; foreign exchange and financial services; and global account digital solution. It also provides acquisition, sale, and custody of securities; structures and distri",
      "market_cap": 4062887168,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SE",
      "sector": "Consumer Cyclical",
      "industry": "Internet Retail",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:35.052557+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "Singapore",
      "website": "https://www.sea.com",
      "employee_count": 80700,
      "business_summary": "Sea Limited, through its subsidiaries, operates as a consumer internet company in Southeast Asia, Latin America, the rest of Asia, and internationally. The company operates through E-commerce, Digital financial services, and Digital entertainment segments. It offers Garena, a digital entertainment platform for users to access mobile and PC online games, as well as promotes eSports operations and develops games. The company also operates the Shopee e-commerce platform, a mobile-centric marketplac",
      "market_cap": 62908035072,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "KSPI",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:36.222282+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "Kazakhstan",
      "website": "https://ir.kaspi.kz",
      "employee_count": null,
      "business_summary": "Joint Stock Company Kaspi.kz, together with its subsidiaries, provides payments, marketplace, and fintech solutions for consumers and merchants in Kazakhstan, Azerbaijan, and Ukraine. It operates in three segments: Payments, Marketplace, and Fintech. The Payments segment offers a platform that facilities transactions between and among merchants and consumers. This segment provides ways for consumers to pay for shopping transactions and regular household bills, as well as make peer to peer paymen",
      "market_cap": 15332999168,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "LUNR",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:37.389074+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NGM",
      "country": "United States",
      "website": "https://www.intuitivemachines.com",
      "employee_count": 435,
      "business_summary": "Intuitive Machines, Inc. designs, manufactures, and operates space products and services in the United States. The company provides delivery services for the transportation and delivery of payloads, such as satellites, scientific instruments, and cargo to various destinations in space, rideshare delivery, and lunar surface access; data transmission services, which include the collection, processing, and interpretation of space-based data, utilizing AI applications, such as command, control, comm",
      "market_cap": 2363782656,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "HOOD",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:38.527276+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://robinhood.com",
      "employee_count": 2300,
      "business_summary": "Robinhood Markets, Inc. operates financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds (ETFs), American depository receipts, options, gold, and cryptocurrencies. The company offers fractional trading, recurring investments, fully-paid securities lending, access to investing on margin, cash sweep, instant withdrawals, retirement program, around-the-clock trading, joint investing accounts, event contracts, and future contract service",
      "market_cap": 72492605440,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "APP",
      "sector": "Communication Services",
      "industry": "Advertising Agencies",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:39.702719+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.applovin.com",
      "employee_count": 1533,
      "business_summary": "AppLovin Corporation engages in building a software-based platform for advertisers to enhance the marketing and monetization of their content in the United States and internationally. It operates through two segments, Advertising and Apps. The company offers AppDiscovery, an advertising solution, which matches advertiser demand with publisher supply through auctions; MAX, an in-app bidding technology that optimizes the value of a publisher's advertising inventory by running a real-time competiti",
      "market_cap": 131017719808,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CHYM",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:40.856879+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.chime.com",
      "employee_count": null,
      "business_summary": "Chime Financial, Inc., a financial technology company, provides digital consumer banking and payment solutions. It offers Chime, a banking application for providing mobile banking services that address the need of people, such as their spending, saving, accessing liquidity, building credit, savings and perks, community, and support and security. Chime Financial, Inc. was formerly known as 1Debit Inc. and changed its name to Chime Financial, Inc. in June 2019. Chime Financial, Inc. was incorporat",
      "market_cap": 8139579392,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "NU",
      "sector": "Financial Services",
      "industry": "Banks - Regional",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:42.077656+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "Brazil",
      "website": "https://www.nubank.com.br",
      "employee_count": null,
      "business_summary": "Nu Holdings Ltd. provides digital banking platform in Brazil, Mexico, Colombia, the Cayman Islands, and the United States. It offers spending solutions comprising Nu credit and prepaid card, a digitally enabled card that acts as a credit and a prepaid card; Nubank+ Tier, an evolution of the Nu experience; Ultraviolet credit and prepaid card, a premium metal credit card; mobile payment solutions for NuAccount customers to make and receive transfers, pay bills, and make everyday purchases through ",
      "market_cap": 82471698432,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "COIN",
      "sector": "Financial Services",
      "industry": "Financial Data & Stock Exchanges",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:43.280538+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.coinbase.com",
      "employee_count": 3772,
      "business_summary": "Coinbase Global, Inc. operates platform for crypto assets in the United States and internationally. It offers the primary financial account in the crypto economy for consumers; a brokerage platform with a pool of liquidity across the crypto marketplace for institutions; and a suite of products granting access to build onchain for developers. The company was founded in 2012 and is based in New York, New York.",
      "market_cap": 45469663232,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CRCL",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:44.414902+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.circle.com",
      "employee_count": null,
      "business_summary": "Circle Internet Group, Inc. operates as a platform, network, and market infrastructure for stablecoin and blockchain applications. The company provides a suite of stablecoins and related products that include a network utility and application platform for organizations to benefit from stablecoins and the internet financial system; and issues a U.S. dollar-denominated stablecoin. Its stablecoins network comprises circle stablecoins, tokenized funds, liquidity, payments, and developer services, as",
      "market_cap": 14006790144,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "IBKR",
      "sector": "Financial Services",
      "industry": "Capital Markets",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:45.562875+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.interactivebrokers.com",
      "employee_count": null,
      "business_summary": "Interactive Brokers Group, Inc. operates as an automated electronic broker in the United States and internationally. The company engages in the execution, clearance, and settlement of trades in stocks, options, futures, foreign exchange instruments, bonds, mutual funds, exchange traded funds (ETFs), precious metals, and cryptocurrencies. It also offers custody and service accounts for hedge and mutual funds, ETFs, registered investment advisors, proprietary trading groups, introducing brokers, a",
      "market_cap": 124843417600,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CCJ",
      "sector": "Energy",
      "industry": "Uranium",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:46.690204+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "Canada",
      "website": "https://www.cameco.com",
      "employee_count": null,
      "business_summary": "Cameco Corporation provides uranium for the generation of electricity. It operates through three segments: Uranium, Fuel Services, and Westinghouse. The Uranium segment engages in the exploration for, mining, milling, purchase, and sale of uranium concentrate. The Fuel Services segment is involved in the refining, conversion, and fabrication of uranium concentrate, as well as purchase and sale of conversion services. The Westinghouse segment operates as a nuclear reactor technology original equi",
      "market_cap": 50136383488,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "UUUU",
      "sector": "Energy",
      "industry": "Uranium",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:47.835528+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "ASE",
      "country": "United States",
      "website": "https://www.energyfuels.com",
      "employee_count": 1370,
      "business_summary": "Energy Fuels Inc., together with its subsidiaries, engages in the exploration, recovery, recycling, exploration, operation, development, permitting, evaluation, and sale of uranium mineral properties in the United States. It produces and sells vanadium pentoxide, rare earth elements, carbonate, and heavy mineral sands, such as ilmenite, rutile, zircon, and monazite. The company was formerly known as Volcanic Metals Exploration Inc. and changed its name to Energy Fuels Inc. in May 2006. Energy Fu",
      "market_cap": 5158524416,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "VRT",
      "sector": "Industrials",
      "industry": "Electrical Equipment & Parts",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:48.980009+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.vertiv.com",
      "employee_count": 31000,
      "business_summary": "Vertiv Holdings Co designs, manufactures, and services critical digital infrastructure technologies and life cycle services for data centers, communication networks, and commercial and industrial environments in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. The company offers AC and DC power management products, switchgear and busbar products, thermal management products, integrated rack systems, modular solutions, and management systems for monitoring and controlling digi",
      "market_cap": 69799682048,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ETN",
      "sector": "Industrials",
      "industry": "Specialty Industrial Machinery",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:50.118671+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "Ireland",
      "website": "https://www.eaton.com",
      "employee_count": 94443,
      "business_summary": "Eaton Corporation plc operates as a power management company in the United States, Canada, Latin America, Europe, and the Asia Pacific. It operates through Electrical Americas, Electrical Global, Aerospace, Vehicle, and eMobility segments. The company offers electrical components, industrial components, power distribution and assemblies, residential products, single and three phase power quality and connectivity products, wiring devices, circuit protection products, utility power distribution pr",
      "market_cap": 142094499840,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MSFT",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:51.250201+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.microsoft.com",
      "employee_count": 228000,
      "business_summary": "Microsoft Corporation develops and supports software, services, devices, and solutions worldwide. The company's Productivity and Business Processes segment offers Microsoft 365 Commercial, Enterprise Mobility + Security, Windows Commercial, Power BI, Exchange, SharePoint, Microsoft Teams, Security and Compliance, and Copilot; Microsoft 365 Commercial products, such as Windows Commercial on-premises and Office licensed services; Microsoft 365 Consumer products and cloud services, such as Microsof",
      "market_cap": 3078416498688,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ADBE",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:52.513392+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.adobe.com",
      "employee_count": 31360,
      "business_summary": "Adobe Inc. operates as a technology company worldwide. The Digital Media segment offers products and services that enable individuals, teams, and enterprises to create, publish, and promote content. This segment serves photographers, video editors, graphic and experience designers, game developers, content creators, students, marketers, business owners, knowledge workers, and consumers. The Digital Experience segment provides an integrated platform; and products, services, and solutions that ena",
      "market_cap": 117086601216,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "FIG",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:53.696779+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.figma.com",
      "employee_count": 1831,
      "business_summary": "Figma, Inc. develops a browser-based tool for designing user interfaces that helps design and development teams build various products. The company offers Figma Design, a collaborative design tool for teams that explore ideas and gather feedback, build realistic prototypes, and streamline product development with design systems; Dev Mode to inspect designs and translate them into code without changing the design file; FigJam to define ideas, align on decisions, and move work forwardall in one p",
      "market_cap": 11155769344,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "PANW",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:54.849133+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.paloaltonetworks.com",
      "employee_count": 16413,
      "business_summary": "Palo Alto Networks, Inc. provides cybersecurity solutions in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. It offers Prisma Access, a secure access service edge solution; Strata Cloud Manager, a network security management solution; and Prisma AIRS to protect customers' entire AI ecosystem. It provides a comprehensive cloud native application protection platform; and Code to Cloud platform, as well as offers VM-Series and CN-Series virtual firewalls for inline netwo",
      "market_cap": 114033598464,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "CRWD",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:56.088273+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.crowdstrike.com",
      "employee_count": 10410,
      "business_summary": "CrowdStrike Holdings, Inc. provides cybersecurity solutions in the United States and internationally. Its unified platform provides cloud-delivered protection of endpoints, cloud workloads, identity, and data through a software as a service (SaaS) subscription-based model. The company offers corporate endpoint and cloud workload security, managed security, security and vulnerability management, IT operations management, identity protection, threat intelligence, data protection, SaaS security pos",
      "market_cap": 104711602176,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "DDOG",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:57.246827+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.datadoghq.com",
      "employee_count": 6500,
      "business_summary": "Datadog, Inc. operates an observability and security platform for cloud applications in the United States and internationally. The company's products comprise infrastructure and application performance monitoring, log management, digital experience monitoring, continuous profiler, database monitoring, data observability, universal service monitoring, network monitoring, error tracking, incident management, workflow automation, observability pipelines, cloud cost and cloud security management, ap",
      "market_cap": 40576110592,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "DUOL",
      "sector": "Technology",
      "industry": "Software - Application",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:58.397501+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.duolingo.com",
      "employee_count": 830,
      "business_summary": "Duolingo, Inc. operates as a mobile learning platform in the United States, the United Kingdom, and internationally. The company offers courses in 40 different languages, including Spanish, English, French, German, Italian, Portuguese, Japanese, and Chinese through its Duolingo app. It also provides a digital English language proficiency assessment exam. The company was incorporated in 2011 and is headquartered in Pittsburgh, Pennsylvania.",
      "market_cap": 5403978240,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ZETA",
      "sector": "Technology",
      "industry": "Software - Infrastructure",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:14:59.611668+00:00",
      "market_cap_category": "mid_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.zetaglobal.com",
      "employee_count": 2191,
      "business_summary": "Zeta Global Holdings Corp. operates an omnichannel data-driven cloud platform that provides enterprises with consumer intelligence and marketing automation software in the United States and internationally. The company's Zeta Marketing platform analyzes billions of structured and unstructured data signals to predict consumer intent by leveraging sophisticated machine learning algorithms and the industry's opted-in data set for omnichannel marketing; and Consumer Data platform (CDP+) delivers rea",
      "market_cap": 4271567360,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "AXON",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:15:00.789624+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.axon.com",
      "employee_count": 4100,
      "business_summary": "Axon Enterprise, Inc. provides public safety technology solutions in the United States and internationally. The company operates in two segments, Software and Sensors, and TASER. The Software and Sensors segment develops, manufactures, and sells integrated hardware and cloud-based software solutions that enable law enforcement to capture, store, manage, share, and analyze video and other digital evidence. This segment also offers body cameras, in-car cameras, other hardware sensors, warranties o",
      "market_cap": 34209656832,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "ALAB",
      "sector": "Technology",
      "industry": "Semiconductors",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:15:01.948566+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.asteralabs.com",
      "employee_count": 440,
      "business_summary": "Astera Labs, Inc. designs, manufactures, and sells semiconductor-based connectivity solutions for cloud and AI infrastructure. It offers an intelligent connectivity platform, comprised of semiconductor-based, mixed-signal connectivity products that integrate a matrix of microcontrollers and sensors, and COSMOS. The company provides COSMOS software suite, a connectivity system management and optimization software that enables management and optimization of resources for large fleets at cloud-scal",
      "market_cap": 24435286016,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "LRCX",
      "sector": "Technology",
      "industry": "Semiconductor Equipment & Materials",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:15:03.183834+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.lamresearch.com",
      "employee_count": 19700,
      "business_summary": "Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits in the United States, China, Korea, Taiwan, Japan, Southeast Asia, and Europe. The company offers ALTUS systems to deposit conformal or selective films for tungsten or molybdenum metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; SPEED g",
      "market_cap": 263489961984,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "BWXT",
      "sector": "Industrials",
      "industry": "Aerospace & Defense",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:15:04.316163+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.bwxt.com",
      "employee_count": 8700,
      "business_summary": "BWX Technologies, Inc. manufactures and sells nuclear components in the United States, Canada, and internationally. It operates through two segments, Government Operations and Commercial Operations. The company manufactures precision naval nuclear components, reactors, and nuclear fuel; close-tolerance and high-quality equipment for nuclear applications; critical nuclear components, fuels and assemblies for government and limited other uses; down blend government stockpiles of uranium; and fabri",
      "market_cap": 17380225024,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "UMAC",
      "sector": "Technology",
      "industry": "Computer Hardware",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:15:05.495744+00:00",
      "market_cap_category": "small_cap",
      "exchange": "ASE",
      "country": "United States",
      "website": "https://www.unusualmachines.com",
      "employee_count": 16,
      "business_summary": "Unusual Machines, Inc. engages in the commercial drone industry. The company offers small drones and essential components. It distributes their products through B2B sale, e-commerce site, and retail channel. The company was formerly known as AerocarveUS Corporation and changed its name to Unusual Machines, Inc. in July 2022. Unusual Machines, Inc. was incorporated in 2019 and is headquartered in Orlando, Florida.",
      "market_cap": 485139168,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MP",
      "sector": "Basic Materials",
      "industry": "Other Industrial Metals & Mining",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:15:06.671396+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://mpmaterials.com",
      "employee_count": 804,
      "business_summary": "MP Materials Corp., together with its subsidiaries, produces rare earth materials in the Western Hemisphere. The company operates in two segments, Materials and Magnetics. The Materials segment owns and operates the Mountain Pass Rare Earth Mine and Processing facility located near Mountain Pass, San Bernardino County, California. The Magnetics segment produces magnetic precursor products. The company was founded in 2017 and is headquartered in Las Vegas, Nevada.",
      "market_cap": 10731304960,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "RR",
      "sector": "Industrials",
      "industry": "Specialty Industrial Machinery",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:15:07.861157+00:00",
      "market_cap_category": "small_cap",
      "exchange": "NCM",
      "country": "United States",
      "website": "https://www.richtechrobotics.com",
      "employee_count": 55,
      "business_summary": "Richtech Robotics Inc. develops, manufactures, deploys, and sells robotic solutions for automation in the service industry in the United States. The company offers commercial robotic products, including Matradee, a line of restaurant service robots for bussing, serving, hosting, advertising, and entertaining; and ADAM and Scorpion, which are dual-arm AI-powered service robots for beverage preparation and customer interaction in hospitality and retail environments. It also provides industrial rob",
      "market_cap": 773642048,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "SNDK",
      "sector": "Technology",
      "industry": "Computer Hardware",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:15:09.024725+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.sandisk.com",
      "employee_count": 11000,
      "business_summary": "Sandisk Corporation develops, manufactures, and sells data storage devices and solutions using NAND flash technology in the United States, Europe, the Middle East, Africa, Asia, and internationally. The company offers solid state drives for desktop and notebook PCs, gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs and other portable and wearable devices, automotive applications, Internet of Things, industrial, and connected ho",
      "market_cap": 86260432896,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "MU",
      "sector": "Technology",
      "industry": "Semiconductors",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:15:10.193452+00:00",
      "market_cap_category": "mega_cap",
      "exchange": "NMS",
      "country": "United States",
      "website": "https://www.micron.com",
      "employee_count": 53000,
      "business_summary": "Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Singapore, Japan, Malaysia, China, India, and internationally. It operates through the Cloud Memory Business Unit (CMBU); Core Data Center Business Unit (CDCBU); Mobile and Client Business Unit (MCBU); and Automotive and Embedded Business Unit (AEBU) segments. The company provides memory products, including dynamic random access memory components and modules, CXL-based mem",
      "market_cap": 427018190848,
      "api_source": "yfinance_python"
    },
    {
      "symbol": "BE",
      "sector": "Industrials",
      "industry": "Electrical Equipment & Parts",
      "confidence": 1.0,
      "sources": [
        "yfinance_python"
      ],
      "last_verified_at": "2026-02-05T03:15:11.374176+00:00",
      "market_cap_category": "large_cap",
      "exchange": "NYQ",
      "country": "United States",
      "website": "https://www.bloomenergy.com",
      "employee_count": 2127,
      "business_summary": "Bloom Energy Corporation designs, manufactures, sells, and installs solid-oxide fuel cell systems for on-site power generation in the United States and internationally. It offers Bloom Energy Server, a power generation platform to convert fuel, such as natural gas, biogas, hydrogen, or a blend of these fuels, into electricity through an electrochemical process without combustion. The company also provides Bloom Electrolyzer for producing hydrogen. It sells its products through direct and indirec",
      "market_cap": 34849861632,
      "api_source": "yfinance_python"
    }
  ],
  "sector_grouping": {
    "Technology": [
      "ASTS",
      "ONDS",
      "MDB",
      "ORCL",
      "TSM",
      "CRM",
      "NVDA",
      "AVGO",
      "CRWV",
      "IONQ",
      "PLTR",
      "RBRK",
      "GRAB",
      "PATH",
      "KSPI",
      "CHYM",
      "MSFT",
      "ADBE",
      "FIG",
      "PANW",
      "CRWD",
      "DDOG",
      "DUOL",
      "ZETA",
      "ALAB",
      "LRCX",
      "UMAC",
      "SNDK",
      "MU"
    ],
    "Consumer Cyclical": [
      "RIVN",
      "AMZN",
      "TSLA",
      "MELI",
      "SE"
    ],
    "Industrials": [
      "PL",
      "RDW",
      "AVAV",
      "RKLB",
      "SMR",
      "KTOS",
      "EOSE",
      "LUNR",
      "VRT",
      "ETN",
      "AXON",
      "BWXT",
      "RR",
      "BE"
    ],
    "Communication Services": [
      "GOOG",
      "META",
      "NFLX",
      "RBLX",
      "APP"
    ],
    "Energy": [
      "LEU",
      "CCJ",
      "UUUU"
    ],
    "Healthcare": [
      "HIMS",
      "TMDX"
    ],
    "Utilities": [
      "VST",
      "CEG",
      "OKLO"
    ],
    "Financial Services": [
      "SOFI",
      "IREN",
      "INTR",
      "HOOD",
      "NU",
      "COIN",
      "CRCL",
      "IBKR"
    ],
    "Basic Materials": [
      "MP"
    ]
  },
  "confidence_distribution": {
    "high_confidence_1_0": 70,
    "fallback_confidence_0_8": 0
  },
  "data_sources": {
    "yfinance_python": 70,
    "fallback_data": 0
  },
  "refresh_metadata": {
    "symbols_updated": 70,
    "symbols_success": 70,
    "symbols_fallback": 0,
    "update_source": "github_actions_python"
  }
}